class Activitys1Controller < ApplicationController
    def index
      @activitys1 = [
        {
          "說明": "【H5點就玩】 簽到、轉盤抽積分、任務中心回答問題累積積分。\n🎁積分兌換商品、咖啡、LINE POINTS。\n👉簽到在首頁右上角",
          "名稱": "H5點就玩",
          "時間": "永久活動",
          "連結": "https://pse.is/S9UZ2",
        },
        {
          "說明": "【Y5遊戲】 （H5/Yahoo版）簽到、任務中心回答問題累積積分。\n🎁積分可以兌換商品、咖啡、LINE POINTS。",
          "名稱": "Y5遊戲",
          "時間": "永久活動",
          "連結": "https://yahoo.wakool.net/welfare-center/quest",
        },
        {
          "說明": "🚘tada台灣車主協會【每天打卡】\n🎁獲得5績分,500積分➡️5LP",
          "名稱": "tada台灣車主",
          "時間": "永久活動",
          "連結": "https://line.me/R/oaMessage/@tada_car/%23我要打卡",
        },
        {
          "說明": "商略問卷代發轉盤抽獎\n🎁獎品有Airpods2藍芽耳機、7-11 100元購物金、吃茶趣50元券、line points10點等",
          "名稱": "商略問卷",
          "時間": "永久活動",
          "連結": "https://line.me/R/oaMessage/@032okdnb/?%40兌換抽獎/活動",
        },
        {
          "說明": "foodpanda Line官方帳號簽到",
          "名稱": "foodpanda",
          "時間": "❶簽到➡️🎁food panda 點10點",
          "連結": "https://line.me/R/oaMessage/@foodpanda.tw/每天都來報到喔",
        },
        {
          "說明": "foodpanda Line官方帳號簽到",
          "名稱": "foodpanda",
          "時間": "❷互動得點➡️🎁food panda 點5點",
          "連結": "https://line.me/R/oaMessage/@foodpanda.tw/領取每日互動點數",
        },
        {
          "說明": "yes123簽到",
          "名稱": "yes123簽到",
          "時間": "永久活動",
          "連結": "https://m.yes123.com.tw/admin/freego_2019/activity.asp",
        },
        {
          "說明": "台灣人壽丨i健康專區\n網路會員(非保戶亦可參加)健康量測➡️【每日】上傳資訊➡️累積健康積分\n⏰2022/04/01起🎁積分兌換7-ELEVEN咖啡、購物金等好禮\n👉https://pse.is/44umq9\n⚠️如在LINE中進入活動屢次無法登入時，建議使用瀏覽器打開活動網頁",
          "名稱": "台灣人壽",
          "時間": "永久活動",
          "連結": "https://line.me/R/oaMessage/@taiwanlife/加值有禮",
        },
        {
          "說明": "📣i運動資訊",
          "名稱": "i運動資訊",
          "時間": "🔥每月1號抽獎唷",
          "連結": "https://line.me/R/oaMessage/@isports",
        },
        {
          "說明": "金石堂會員活動-簽到金幣天天領",
          "名稱": "金石堂",
          "時間": "永久活動",
          "連結": "https://www.kingstone.com.tw/ksmember/home/#dailycheck",
        },
        {
          "說明": "富邦產險【保心安YO-好康馬拉松】\n⏰即日起至～7/31每日均有1次抽獎機會，活動期間僅可中獎1次\n\n❶尋找刮刮卡強制險\nLINE POINTS 50點50名加碼25名\n❷尋找刮刮卡手機險\nLINE POINTS 50點50名加碼25名\n❸ 尋找刮刮卡寵物險(至8/14)\nLINE POINTS 50點25名\n⚠️若幸運中獎，請填寫中獎人資訊，未填寫則視為放棄中獎資格。\n🛎獎品序號將於活動截止後三週內，email至您於中獎人資訊中填寫的信箱。",
          "名稱": "富邦產險",
          "時間": "⏰即日起至～7/31",
          "連結": "https://b2c.518fb.com/FubonWEBA/luckyparty/home?slideIndex=0",
        },
        {
          "活動": "蝦皮寶箱，人人有獎，點就領蝦幣",
          "名稱": "蝦幣寶箱",
          "時間": "永久活動",
          "連結": "https://shp.ee/ii4iivjsxey",
        },
        {
          "活動": "從蝦皮購物APP：「我的」頁面▶️「我的蝦幣」▶️蝦幣獎勵頁面▶️「今日簽到獲得蝦幣」即可賺取當日蝦幣獎勵",
          "名稱": "蝦幣簽到",
          "時間": "永久活動",
          "連結": "https://risu.io/yUrX",
        },
        {
          "活動": "西瓜的下班人生 LINE官帳\n【西瓜堂算命館】\n每次20秒，天天登入玩遊戲，接入降落的爆米花、鑽石、金幣即可\n獲得1點紅利點數,每月最高30點\n➡️持續累點兌換活動贈品兑換至2023/02/15止",
          "名稱": "新光人壽",
          "時間": "⏰5/16~12/31",
          "連結": "https://line.me/R/ti/p/@sk2u99",
        },
        {
          "活動": "台灣安麗簽到\n🎁首日簽到即可兌換5點LP",
          "名稱": "台灣安麗",
          "時間": "永久活動",
          "連結": "https://line.me/R/oaMessage/@amway",
        },
        {
	        "活動": "[購物]每日領[閑錢]\n[遊戲]每日簽到任務",
	        "名稱": "beanfun",
	        "時間": "每週六中午12時，開搶50元零用金",
	 	      "連結": "https://lihi1.com/nUlLa",
        },
        {
          "活動": "📣我的VIP丨中華電信我的服務中心\n會員生日賀禮",
          "名稱": "中華電信",
          "時間": "⏱️2022/01/01~2022/12/31",
          "連結": "https://vip.cht.com.tw/my/winner-list",
        },
        {
          "活動": "momo購物網\n📣恭喜你收到幸運柴柴的獨家訊息⚡\n2022年每週一~週日於momo/PChome購物\n💥刷JCB卡滿2,000送200\n血拚前別忘了先登錄唷❗\n週一15:00限量開搶",
          "名稱": "momo購物網",
          "時間": "⏱️2022/01/03~2022/12/31",
          "連結": "https://momo.dm/3vnNmQ",
        },
        {
          "活動": "南山人壽投保萌寵訓練師\n簽到任務\n🍀週週簽到➡️抽5點LPs\n🚀每月集餵養徽章➡️換好禮",
          "名稱": "南山人壽",
          "時間": "週週簽到",
          "連結": "https://bit.ly/3vUiDso",
        },
        {
          "說明": "📣南山聚樂部 ｜會員650點兌換LINE POINTS 10點",
          "名稱": "南山人壽",
          "時間": "優惠兌換期間2022/09/30",
          "連結": "https://bit.ly/3xWxrIh",
        },
        {
          "活動": "📣新光人壽\n🍩綁定推薦禮最高200點\n🍩LINE每月簽到集5點\n🍩新壽會員專區每月登入集5點\n＊以上點數為新光獨家SK點數\n官方LINE帳號https://line.me/R/ti/p/@shinkonglife",
          "名稱": "新光人壽",
          "時間": "每月簽到",
          "連結": "https://bit.ly/3upzMvP",
        },
        {
          "活動": "新光人壽\\n集點平台丨獎品兌換",
          "名稱": "新光人壽",
          "時間": "獎品兌換",
          "連結": "https://tinyurl.com/2p8xzf7v",
        },
        {
          "活動": "綁定會員每週簽到活動\n謹綁定新光人壽LINE好友，無須購買保險商品。",
          "名稱": "新光人壽",
          "時間": "若有需求➡️多一個諮詢管道\n❣️活動辦法",
          "連結": "https://bit.ly/3N9pSVJ",
        },
        {
          "活動": "HAPPY GO APP活動\n點點出任務：雅詩蘭黛NO.1粉持久【簽到得點領試用】\n🎁每簽到7天1點HG點",
          "名稱": "HAPPYGO",
          "時間": "⏰8/1～8/31",
          "連結": "https://hgapp.page.link/F48Zi7LqXgVK3nf2A",
        },
        {
          "活動": "HAPPY GO APP活動\n「點點出任務：雲端益智來挑戰抽20點」每天\n🎁20HG點(600名)。",
          "名稱": "HAPPYGO",
          "時間": "9/8公佈結果，9/16歸戶，效期12/31",
          "連結": "https://hgapp.page.link/foec2JWgtpdgg7FU6",
        },
        {
          "活動": "HAPPY GO APP活動\n「點點出任務：HAPPY GO綁定發票限定轉盤」5-6月份發票中奬卡友限定\n🎁10萬HG點(1名)、5千HG點(30名)、5百HG點(400名)、其餘5點，人人有奬\n⚠️31天玩一次",
          "名稱": "HAPPYGO",
          "時間": "效期11/30",
          "連結": "https://hgapp.page.link/ww4FSknVb3qSD8tY9",
        },
        {
          "說明": "HAPPY GO APP活動\n「點點出任務：好鄰挖寶巡禮」\n至台北市/板橋區/桃園市/新竹縣市/台中市任一商圈HAPPY GO特店通路打卡拿HG點\n🎁1點HG點\n⚠️每5天可玩一次",
          "名稱": "HAPPYGO",
          "時間": "⏰8/1～8/31",
          "連結": "https://hgapp.page.link/kRcJ6LPKnZjXNB6q9",
        },
        {
          "說明": "HAPPY GO APP活動\n「點點出任務：簽到得1點」\n🎁每累積指定天數1點HG點(限量700000點)5～10分鐘歸戶，",
          "名稱": "HAPPYGO",
          "時間": "效期9/30",
          "連結": "https://hgapp.page.link/ZQXsYccqFAQDjCYr5",
        },
        {
          "說明": "HAPPY GO APP活動\n「點點出任務：好鄰點點名」\n🎁簽到7天1點HG點(7～9月每月最多1點)立即歸戶\n🎁抽BALMUDA蒸汽烤麵包機",
          "名稱": "HAPPYGO",
          "時間": "效期12/31",
          "連結": "https://hgapp.page.link/NLCNQmcTkMfj9ucA8",
        },
        {
          "說明": "HAPPY GO APP活動\n「點點出任務：歡慶88節請爸爸喝咖啡」機會、命運二選一\n🎁最高200HG點",
          "名稱": "HAPPYGO",
          "時間": "⏰8/8~8/15",
          "連結": "https://hgapp.page.link/DB8WjDQnBpN7NW649",
        },
        {
          "活動": "中信亮點APP每日簽到！\n累積【中信亮點】\n📲每天關注一支股票，累積【中信亮點】\n🎁兌換全家購物金$100、金色三麥購物金$3,000、Switch OLED\n🏆每月7、17、27日挑戰天降股利活動，亮點加贈7點\n每月全勤再拿亮點10點",
          "名稱": "中信亮點",
          "時間": "每月7、17、27日",
          "連結": "https://insightctbcsec.page.link/tqgE",
        },
        {
          "活動": "LINE GAME【天天抽籤拿紅包，蒐集神獸集好運】加入學院會員直接玩↓\n❶「LINE POINTS 新年紅包」有機會獲得 LINE POINTS 888點、88點、8點、2點 或 新年紀念桌布1份。\n❷「神獸蒐集冊獎勵」可獲得 LINE POINTS 5點。",
          "名稱": "LINE GAME",
          "時間": "⏰6/13～11/30\n每月7、17、27日",
          "連結": "https://lin.ee/UCXK1dt/gmtw/OAP",
        },
        {
          "活動": "LINE購物護照🎁抽最高1,688點 LINE POINTS",
          "名稱": "LINE購物護照",
          "時間": " ",
          "連結": "https://lineshopping.page.link/vUSDLcXTk7N25Bub9",
        },
        {
          "說明": "📣國泰優惠APP🚀搖一搖",
          "名稱": "國泰優惠",
          "時間": "⏱️每週一、三、五 PM 03:15",
          "連結": "https://myrewards.app.link",
        },
        {
          "說明": "📣國泰優惠APP【任務牆】\n🔔每月5號會員日➡️開始簽到\n📝8月須簽到５次\n🎁５點 小樹點 ⚠️限量12萬名",
          "名稱": "國泰優惠",
          "時間": "8/5~8/31",
          "連結": "https://tinyurl.com/7mkq4clj",
        },
        {
          "說明": "📣國泰優惠APP",
          "名稱": "國泰優惠",
          "時間": "8月國泰優惠會員日活動",
          "連結": "https://mr202208vip.ryzoweba.io/",
        },
        {
          "說明": "📣LINE VOOM 官號\n🐯2022第四屆走鐘獎【潛力新星獎】觀眾票選\n\n🎁獎項\n1.第四屆走鐘獎典禮入場券\n2.最高100點 LINE POINTS\n3.最高100元 LINE TAXI乘車券\n4.走鐘獎主題手機桌布\n🔥天天投滿３票➡️乙次抽獎",
          "名稱": "LINE VOOM",
          "時間": "⏱️2022/08/08~2022/08/22",
          "連結": "line://ti/p/@linevoomtw",
        },
        {
          "說明": "飛比簽到",
          "名稱": " ",
          "時間": " ",
          "連結": "https://rotf.lol/Feebee",
        },
        {
          "說明": "UUPON APP每日簽到 賺點",
          "名稱": "UUPON",
          "時間": " ",
          "連結": "https://appevts.uupon.com/dailysignin/page",
        },
        {
          "說明": "康是美簽到任務～連續7天登入，即可獲得OPEN POINT 1點！（1點 = NT 1元）",
          "名稱": "康是美",
          "時間": "永久時效",
          "連結": "https://us9e5.app.goo.gl/SKrcB",
        },
        {
          "說明": "遠傳心生活打卡(更新版本之後需要定位，無法使用)",
          "名稱": "遠傳心生活",
          "時間": "永久時效",
          "連結": "https://reurl.cc/ZG2qoW",
        },
        {
          "說明": "遠東百貨APP\n每日簽到（限額30000名）\n🎁連續簽到2天得1點, 連續簽到4天得1點, 連續簽到7天得1點 (7天連續簽到成功共得3點HAPPY GO 點)中斷連續簽到天數後重新累積且連續7天後再由第1天開始累積\n🎰 解鎖遊戲/任務 得點超EASY",
          "名稱": "遠東百貨",
          "時間": "⏰8/1～8/31",
          "連結": "https://www.feds.com.tw/app/fedsappdownload.asp",
        },
        {
          "說明": "全家APP【好好玩】(H5/全家版)簽到、任務中心回答問題累積積分。\n🎁積分可以兌換霜淇淋、咖啡、衛生紙。",
          "名稱": "全家",
          "時間": "永久時效",
          "連結": "https://bit.ly/3pXTgES",
        },
        {
          "說明": "全家【冰涼FUN開喝】刮刮樂第二彈\n🎁最低9元特大杯冰塊",
          "名稱": "全家",
          "時間": "⏰7/27 10:00～8/23(可能提前結束)",
          "連結": "https://bit.ly/3PD63Ik",
        },
        {
          "說明": "7-ELEVEN遊樂場APP【夏日大Bingo】飲料抽抽樂",
          "名稱": "統一超商",
          "時間": "7/13～8/23 每人每天可各玩2次",
          "連結": "https://sevenmobileapp.page.link/3Pja",
        },
        {
          "說明": "7-ELEVEN_LINE官方帳號",
          "名稱": "統一超商",
          "時間": "7/13～8/23 每人每天可各玩2次",
          "連結": "https://reurl.cc/g2O9eQ",
        },
        {
          "說明": "家樂福APP【普渡輪盤】好康轉轉樂\n🎁錢包儲值金、會員紅利點數、線上折扣碼(效期8/31)每日最高抽1名688儲值金\n⚠️需先下載家樂福APP，並完成家樂福錢包開通和綁定家樂福好康卡，才具有參加本活動之資格。",
          "名稱": "家樂福",
          "時間": "7/27～8/16",
          "連結": "https://tinyurl.com/mrxmsz9j",
        },
        {
          "說明": "",
          "名稱": "",
          "時間": "",
          "連結": "",
        },
        {
          "說明": "",
          "名稱": "",
          "時間": "",
          "連結": "",
        },
        {
          "說明": "",
          "名稱": "",
          "時間": "",
          "連結": "",
        },
        {
          "說明": "",
          "名稱": "",
          "時間": "",
          "連結": "",
        },
        {
          "說明": "",
          "名稱": "",
          "時間": "",
          "連結": "",
        },
        {
          "說明": "",
          "名稱": "",
          "時間": "",
          "連結": "",
        },
        {
          "說明": "",
          "名稱": "",
          "時間": "",
          "連結": "",
        },           
    ]

    @keyword = params[:keyword]

    if @keyword.present?
        @activitys1.filter! do |activity|
            activity[:名稱].include? @keyword
      end
    end
    @activitys1 = @activitys1.first(12)
  end
end