class Creditcards23Controller < ApplicationController
	def index
	@creditcards23 = [                       
        {
                "銀行1": "各家銀行",
                "回饋1": "說明",
                "綁定1": "繳費地點與支付APP\\n統一超商/全家/橘子支付",
                "趴數1": "回饋%數",
                #分隔線
                "銀行2": " ",
                "回饋2": " ",
                "綁定2": " ",
                "趴數2": " ",
        },
        {
                "銀行1": "新光分期七卡",
                "回饋1": "每月回饋上限110元,需逐月登錄",
                "綁定1": "711繳費OPEN錢包",
                "趴數1": "11%",
                #分隔線
                "銀行2": "新光寰宇現金回饋卡",
                "回饋2": "每月回饋上限100",
                "綁定2": "全家繳費Famipay",
                "趴數2": "10% ",
        },
        {
                "銀行1": "Linebank快點卡",
                "回饋1": "每月回饋上限500點",
                "綁定1": "全家繳費Famipay",
                "趴數1": "3%",
                #分隔線
                "銀行2": "新光悠遊聯名卡",
                "回饋2": "每帳單月回饋上限300",
                "綁定2": "全家繳費Famipay",
                "趴數2": "2.1%每帳單月回饋上限300",
        },
        {
                "銀行1": "魔Buy卡",
                "回饋1": "當月指定支付需滿3000及登錄 ,舊戶3000~5000 6%,新戶3000~3333 8%",
                "綁定1": "橘子支付",
                "趴數1": "舊戶6%\\n新戶 8%",
                #分隔線
                "銀行2": "玉山Ubear卡",
                "回饋2": " ",
                "綁定2": "橘子支付",
                "趴數2": "3.8%",
        },
        {
                "銀行1": "華南i網購",
                "回饋1": " ",
                "綁定1": "橘子支付",
                "趴數1": "3.5%",
                #分隔線
                "銀行2": " ",
                "回饋2": " ",
                "綁定2": " ",
                "趴數2": " ",
        },


	]

	@keyword = params[:keyword]

	if @keyword.present?
		@creditcards23.filter! do |creditcard|
			creditcard[:銀行1].include? @keyword
			end
		end
    end
end