class Creditcards5Controller < ApplicationController
	def index
			@creditcards5 = [
                {
					"銀行1": "彰銀My購卡",
					"回饋1": "一般網購4%\\n六日指定通路消費8%\\n網購2%+上市首年1%合併每月刷卡上限10000,\\n六日指定通路加碼4%每月上限5000",
					"綁定1": " ",
					"趴數1": "4%或8%",
					#分隔線
					"銀行2": "KOKO COMBO icash",
					"回饋2": "單月新增帳金5000,上限6000,需符合指定通路",
					"綁定2": " ",
					"趴數2": "5%",
			},
			{
					"銀行1": "上海Teresa卡",
					"回饋1": "每月上限10000,需符合指定通路",
					"綁定1": " ",
					"趴數1": "3.8%",
					#分隔線
					"銀行2": "玉山UBear",
					"回饋2": "每月回饋上限200,刷卡上限5263",
					"綁定2": " ",
					"趴數2": "3.8%",
			},
			{
					"銀行1": "台新gogo",
					"回饋1": " 0.2%基本+0.8%任務+2%指定+3%週六\\n帳單金額滿5000才有任務0.8%,\\n每期帳單任務,指定,週六回饋上限各200",
					"綁定1": " ",
					"趴數1": "2.2%~3%\\n星期六指定通路5.2%~6%",
					#分隔線
					"銀行2": "華南i網購",
					"回饋2": "上限10000,需帳戶自動扣款",
					"綁定2": " ",
					"趴數2": "3.5%",
			},
			{
					"銀行1": "LineBank快點卡",
					"回饋1": "每月回饋上限500LP",
					"綁定1": " ",
					"趴數1": "3%",
					#分隔線
					"銀行2": "台新玫瑰giving",
					"回饋2": " ",
					"綁定2": " ",
					"趴數2": "平日2% 假日3%",
			},
			{
					"銀行1": "合庫藍兔",
					"回饋1": "上限15000",
					"綁定1": " ",
					"趴數1": "3%",
					#分隔線
					"銀行2": "兆豐e秒刷",
					"回饋2": "加碼0.5%需本行自動扣繳成功,\\n新戶再額外加碼1%",
					"綁定2": " ",
					"趴數2": "3%~4%",
			},
			{
					"銀行1": "富邦J JU卡\\n聯邦賴點卡\\n富邦數位生活",
					"回饋1": " ",
					"綁定1": " ",
					"趴數1": "2%",
					#分隔線
					"銀行2": " ",
					"回饋2": " ",
					"綁定2": " ",
					"趴數2": " ",
			},

	]

	@keyword = params[:keyword]

	if @keyword.present?
		@creditcards5.filter! do |creditcard|
			creditcard[:銀行1].include? @keyword
			end
		end
    end
end