class Creditcards6Controller < ApplicationController
	def index
			@creditcards6 = [
                {
					"銀行1": "上海牙醫師全聯會世界悠遊卡",
					"回饋1": "每月上限10000,需申請電帳&本行自動扣繳及登錄",
					"綁定1": " ",
					"趴數1": "10%",
					#分隔線
					"銀行2": "永豐三井聯名卡",
					"回饋2": "需登錄,每月上限2000,當期帳單需新增非餐廳及外送一般消費1000",
					"綁定2": " ",
					"趴數2": "10%",
			},
			{
					"銀行1": "一銀宜蘭卡\\n義享天地聯名卡",
					"回饋1": "每月上限7000",
					"綁定1": " ",
					"趴數1": "單筆滿 300 5%",
					#分隔線
					"銀行2": "永豐JCB現金回饋卡",
					"回饋2": "刷卡上限10000,當期帳單需新增消費5000",
					"綁定2": " ",
					"趴數2": "4%",
			},
			{
					"銀行1": "上海Teresa卡",
					"回饋1": "每月上限10000",
					"綁定1": " ",
					"趴數1": "3.8%",
					#分隔線
					"銀行2": "樂天卡",
					"回饋2": "需逐月登錄及電子帳單,每月上限26666",
					"綁定2": " ",
					"趴數2": "3%",
			},

	]

	@keyword = params[:keyword]

	if @keyword.present?
		@creditcards6.filter! do |creditcard|
			creditcard[:銀行1].include? @keyword
			end
		end
    end
end