class Creditcards20Controller < ApplicationController
	def index
	@creditcards20 = [                       
        {
                "銀行1": "各家銀行",
                "回饋1": "街口繳費可參照綁定支付,\\n超商繳費可參照超商代收,\\nicash繳費在7-11",
                "綁定1": "繳費地點與支付APP\\台北/桃園可用街口繳費\\n新北台中彰化雲林台南屏東台東用橘子支付",
                "趴數1": "繳費項目:\\n回饋%數",
                #分隔線
                "銀行2": " ",
                "回饋2": " ",
                "綁定2": " ",
                "趴數2": " ",
        },
        {
                "銀行1": "新光寰宇現金回饋卡",
                "回饋1": "每月回饋上限100",
                "綁定1": "全家繳費Famipay",
                "趴數1": "10%",
                #分隔線
                "銀行2": "Linebank快點卡",
                "回饋2": "每月回饋上限500點",
                "綁定2": "全家繳費Famipay",
                "趴數2": "3%",
        },
        {
                "銀行1": "新光悠遊聯名卡",
                "回饋1": "每帳單月回饋上限300",
                "綁定1": "全家繳費Famipay",
                "趴數1": "2.1%",
                #分隔線
                "銀行2": " ",
                "回饋2": " ",
                "綁定2": " ",
                "趴數2": " ",
        },
        {
                "銀行1": "新光分期七卡",
                "回饋1": "每月回饋上限110元,需逐月登錄",
                "綁定1": "711繳費OPEN錢包",
                "趴數1": "11%",
                #分隔線
                "銀行2": "國泰Cube icash卡",
                "回饋2": "需逐月登錄,每月回饋上限200點",
                "綁定2": "自動加值",
                "趴數2": "10%",
        },
        {
                "銀行1": "一銀icash聯名卡\\n宜蘭認同icash卡",
                "回饋1": "新卡icash 10% OP_核卡後90天內",
                "綁定1": "自動加值",
                "趴數1": "10%",
                #分隔線
                "銀行2": "元大Hello Kitty鑽金聯名卡",
                "回饋2": "每期帳單回饋上限100",
                "綁定2": "自動加值",
                "趴數2": "新戶5%",
        },
        {
                "銀行1": "土銀icash2.0聯名卡",
                "回饋1": "每月回饋上限200",
                "綁定1": "自動加值",
                "趴數1": "5%",
                #分隔線
                "銀行2": "華南超級點數卡",
                "回饋2": "當期帳單需新增兩筆711或累積2711消費,每月上限100點",
                "綁定2": "自動加值",
                "趴數2": "5%",
        },
        {
                "銀行1": "魔Buy卡",
                "回饋1": "當月指定支付需滿3000及登錄,舊戶3000~5000 6%,新戶3000~3333 8%",
                "綁定1": "街口/橘子支付",
                "趴數1": "舊戶6%\\n新戶 8%",
                #分隔線
                "銀行2": "陽信JCB哆啦A夢晶緻卡\\n彭大家族聯名卡",
                "回饋2": "舊戶加碼2% & 新戶/新卡友加碼5%每月回饋上限300",
                "綁定2": "街口/Linepay",
                "趴數2": "舊戶3%\\n新戶/新卡友6%",
        },
        {
                "銀行1": "一銀ileo卡",
                "回饋1": "每月刷卡上限8333,需ileo帳戶扣繳",
                "綁定1": "街口",
                "趴數1": "舊戶5%\\n新戶6%",
                #分隔線
                "銀行2": "彰銀my樂卡",
                "回饋2": "需每月一號登錄",
                "綁定2": "街口",
                "趴數2": "3.5%or6.5%",
        },
        {
                "銀行1": "台新街口聯名卡",
                "回饋1": "回饋為街口幣 , 每月上限4000",
                "綁定1": "街口",
                "趴數1": "週三 6%",
                #分隔線
                "銀行2": "匯豐匯鑽卡",
                "回饋2": "3%or6%",
                "綁定2": "街口",
                "趴數2": "3%or6%",
        },
        {
                "銀行1": "玉山Ubear",
                "回饋1": " ",
                "綁定1": "街口/橘子支付",
                "趴數1": "3.8%",
                #分隔線
                "銀行2": "華南i網購",
                "回饋2": " ",
                "綁定2": "街口/橘子支付",
                "趴數2": "3.5%",
        },
        {
                "銀行1": "合庫藍兔",
                "回饋1": " ",
                "綁定1": "街口",
                "趴數1": "3%",
                #分隔線
                "銀行2": " ",
                "回饋2": " ",
                "綁定2": " ",
                "趴數2": " ",
        },

	]

	@keyword = params[:keyword]

	if @keyword.present?
		@creditcards20.filter! do |creditcard|
			creditcard[:銀行1].include? @keyword
			end
		end
    end
end