class Creditcards14Controller < ApplicationController
	def index
			@creditcards14 = [
            {
					"銀行1": "聯邦幸福M卡",
					"回饋1": "6%回饋上限500,每月刷卡上限8333\\n新戶核卡30日內加碼14%上限500",
					"綁定1": "台鐵/高鐵",
					"趴數1": "舊戶6% / 新戶20%",
					#分隔線
					"銀行2": "合庫樂活卡",
					"回饋2": "原卡0.5%+電帳0.5%+指定通路5%,5%每月回饋上限300",
					"綁定2": "台鐵/高鐵",
					"趴數2": "6%",
			},
			{
					"銀行1": "合庫i運動卡",
					"回饋1": "當期帳單需新增一般消費2999,每月刷卡上限2000",
					"綁定1": "台鐵/高鐵",
					"趴數1": "5.5%",
					#分隔線
					"銀行2": "一銀綠活卡",
					"回饋2": "需新增單筆滿千一般消費",
					"綁定2": "台鐵/高鐵",
					"趴數2": "5%",
			},
			{
					"銀行1": "國泰KOKO COMBO icash",
					"回饋1": "每期需新增帳金5000,上限6000",
					"綁定1": "台鐵/高鐵",
					"趴數1": "5%",
					#分隔線
					"銀行2": "台新Flygo",
					"回饋2": "帳單金額少於5000 4.2% ,帳單金額滿5000 5%,\\n需Richart自動扣繳\\n通路4% 刷卡上限5000",
					"綁定2": "高鐵",
					"趴數2": "4.2%or5%",
			},
			{
					"銀行1": "彰銀my購",
					"回饋1": " ",
					"綁定1": "台鐵/高鐵",
					"趴數1": "4%",
					#分隔線
					"銀行2": "上海Teresa卡",
					"回饋2": "每期上限10000",
					"綁定2": "台鐵/高鐵",
					"趴數2": "3.8%",
			},
			{
					"銀行1": "玉山ubear卡",
					"回饋1": " ",
					"綁定1": "台鐵/高鐵",
					"趴數1": "3.8%",
					#分隔線
					"銀行2": "華南i網購",
					"回饋2": " ",
					"綁定2": "台鐵/高鐵",
					"趴數2": "3.5%",
			},

	]

	@keyword = params[:keyword]

	if @keyword.present?
		@creditcards14.filter! do |creditcard|
			creditcard[:銀行1].include? @keyword
			end
		end
    end
end