class Creditcards12Controller < ApplicationController
	def index
			@creditcards12 = [
            {
					"銀行1": "花旗饗樂生活卡+AP",
					"回饋1": "單趟需滿25元,折抵上限50元",
					"綁定1": "Goshare",
					"趴數1": "單趟25-100 現折50%",
					#分隔線
					"銀行2": "兆豐GOGORO聯名卡",
					"回饋2": "每帳單週期10%加碼回饋上限100\\n新卡友加碼10%上限100",
					"綁定2": "Goshare",
					"趴數2": "舊戶 15% 新卡友 25%",
			},
			{
					"銀行1": "華南i網購東奧卡",
					"回饋1": "每帳單週期回饋500,刷卡上限2500",
					"綁定1": "Wemo",
					"趴數1": "20%",
					#分隔線
					"銀行2": "聯邦賴點卡",
					"回饋2": "每月15號到月底前登錄,\\n每月回饋上限100元",
					"綁定2": "Goshare / iRent / Wemo",
					"趴數2": "12%",
			},
			{
					"銀行1": "聯邦綠卡",
					"回饋1": "不與指定APP共同回饋",
					"綁定1": "Goshare / iRent / Wemo",
					"趴數1": "10%",
					#分隔線
					"銀行2": "一銀綠活卡",
					"回饋2": "需登錄 , 每月刷卡上限3000",
					"綁定2": "Goshare / iRent / Wemo",
					"趴數2": "10%",
			},
			{
					"銀行1": "星展eco卡",
					"回饋1": " ",
					"綁定1": "iRent / Wemo",
					"趴數1": "8%",
					#分隔線
					"銀行2": "永豐大戶卡",
					"回饋2": "需有大戶資格",
					"綁定2": "Goshare / iRent",
					"趴數2": "7%",
			},
			{
					"銀行1": "遠銀樂家+卡",
					"回饋1": "每月回饋上限600,\\n需遠銀帳戶自扣成功後次期帳單",
					"綁定1": "Goshare / iRent / Wemo",
					"趴數1": "6%",
					#分隔線
					"銀行2": "台新Flygo",
					"回饋2": "帳單金額小於5000=4.2% ,帳單金額滿5000=5%,需Richart自動扣\\n通路4% 刷卡上限5000",
					"綁定2": "Goshare / Wemo",
					"趴數2": "4.2%or5%",
			},
			{
					"銀行1": "國泰 KOKO COMBO ICASH",
					"回饋1": " ",
					"綁定1": "Goshare / Wemo",
					"趴數1": "5%",
					#分隔線
					"銀行2": "彰銀My購卡",
					"回饋2": "網購2%+上市首年1%合併每月刷卡上限10000",
					"綁定2": "Goshare / iRent / Wemo",
					"趴數2": "4%",
			},
			{
					"銀行1": "玉山Ubear",
					"回饋1": " ",
					"綁定1": "Goshare / iRent / Wemo",
					"趴數1": "3.8%",
					#分隔線
					"銀行2": "華南i網購",
                    "回饋2": " ",
 					"綁定2": "Goshare / iRent / Wemo",
					"趴數2": "3.5%",
			},               

	]

	@keyword = params[:keyword]

	if @keyword.present?
		@creditcards12.filter! do |creditcard|
			creditcard[:銀行1].include? @keyword
			end
		end
    end
end