class Creditcards9Controller < ApplicationController
	def index
			@creditcards9 = [
            {
					"銀行1": "華南i網購東奧卡",
					"回饋1": "每帳單週期回饋500,刷卡上限2500",
					"綁定1": "街口",
					"趴數1": "20%",
					#分隔線
					"銀行2": "新光寰宇現金回饋",
					"回饋2": "單月回饋上限100元,可代收",
					"綁定2": "Famipay",
					"趴數2": "10%",
			},
			{
					"銀行1": "華南i網購",
					"回饋1": "每期帳單上限2500",
					"綁定1": "街口",
					"趴數1": "8%",
					#分隔線
					"銀行2": "國泰KOKO COMBO icash",
					"回饋2": "單期新增帳金5000,上限6000",
					"綁定2": " ",
					"趴數2": "5%",
			},
			{
					"銀行1": "台新Flygo",
					"回饋1": "帳單金額<5000=4.2% , 帳單金額>5000=5%,需Richart自動扣繳\\n通路4% 刷卡上限5000",
					"綁定1": "台新Pay",
					"趴數1": "4.2%or5%",
					#分隔線
					"銀行2": "台新gogo",
					"回饋2": "0.2%基本+0.8%任務+2%指定+3%週六\\n帳單金額滿5000才有任務0.8%,每期帳單任務,指定,週六回饋上限各200",
					"綁定2": "Linepay/Famipay/悠遊付/台新Pay",
					"趴數2": "2.2%~3%\\n星期六指定通路 5.2%~6%",
			},
			{
					"銀行1": "玉山Pi卡",
					"回饋1": " ",
					"綁定1": "Pi錢包",
					"趴數1": "4%",
					#分隔線
					"銀行2": "玉山Ubear卡",
					"回饋2": " ",
					"綁定2": "橘子支付/街口",
					"趴數2": "3.8%",
			},
			{
					"銀行1": "Linebank快點卡",
					"回饋1": "每月回饋上限500點,可代收",
					"綁定1": "Famipay",
					"趴數1": "3%",
					#分隔線
					"銀行2": "新光悠遊聯名卡",
					"回饋2": "每月回饋上限300,可代收",
					"綁定2": "Famipay",
					"趴數2": "2.1%",
			},

	]

	@keyword = params[:keyword]

	if @keyword.present?
		@creditcards9.filter! do |creditcard|
			creditcard[:銀行1].include? @keyword
			end
		end
    end
end