class Creditcards2Controller < ApplicationController
    def index
        @creditcards2 = [
            {
                "銀行1": "玉山Only卡 V",
                "回饋1": "每會員週期上限100萬紅利,每期帳單可折抵10000紅利\\n紅利倍多芬會員以紅利10點兌換1元刷卡金計算",
                "綁定1": "Lv3 3.6%\\nLv4 4.4%\\nLv5 5.2%",
                "趴數1": "3.6%-5.2%",
                #分隔線
                "銀行2": "永豐55688聯名卡",
                "回饋2": "搭車當日加碼5%每月上限600,可刷12000\\n回饋為T幣可折抵車資或台鐵高鐵電影院KTV費用",
                "綁定2": "\\n",
                "趴數2": "2%或7%",
            },
            {
                "銀行1": "華南櫃買贏家生活卡",
                "回饋1": "\\n",
                "綁定1": "AP/GP",
                "趴數1": "5%",
                #分隔線
                "銀行2": "遠銀卡",
                "回饋2": "需逐月登錄,滿8000=2%,\\n滿30000=3%,滿50000=5%",
                "綁定2": "\\n",
                "趴數2": "2%~5%",
            },
            {
                "銀行1": "永豐幣倍卡",
                "回饋1": "原回饋2%+國外消費2% 懂匯上限100/超匯上限300,帳單需新增消費2000",
                "綁定1": "\\n",
                "趴數1": "4%",
                #分隔線
                "銀行2": "彰銀my樂",
                "回饋2": "\\n",
                "綁定2": "GP M",
                "趴數2": "3~3.5%",
            },
            {
                "銀行1": "富邦OP卡V",
                "回饋1": "新辦myMoney數位帳戶扣繳多0.5%\\n中港澳",
                "綁定1": "\\n",
                "趴數1": "3%or3.5%",
                #分隔線
                "銀行2": "永豐大戶卡V",
                "回饋2": "1%加碼大戶每月1500",
                "綁定2": "\\n",
                "趴數2": "2%~3%",
            },
            {
                "銀行1": "LineBank快點卡 V",
                "回饋1": "每月回饋上限500LP,刷16666",
                "綁定1": "\\n",
                "趴數1": "3%",
                #分隔線
                "銀行2": "新光寰宇現金回饋卡 V/M",
                "回饋2": "1.5%加碼每月上限2000,每月刷133333",
                "綁定2": "\\n",
                "趴數2": "3%",
            },
            {
                "銀行1": "富邦J卡刷日本J\\n陽信多拉A夢卡日韓J\\n兆豐利多御璽卡\\n",
                "回饋1": "\\n",
                "綁定1": "\\n",
                "趴數1": "3%",
                #分隔線
                "銀行2": "聯邦賴點卡V\\n聯邦幸福M\\n卡M聯邦綠卡V\\n上海簡單卡中日韓 V,M",
                "回饋2": "",
                "綁定2": "\\n",
                "趴數2": "3%",
            },
            {
                "銀行1": "台新玫瑰giving卡 V,M",
                "回饋1": "國外消費回饋2%,台新帳戶自動扣繳+1%\\n每期帳單之國外消費回饋加總，最高回饋上限 NT$5,000",
                "綁定1": "\\n",
                "趴數1": "2%~3%",
                #分隔線
                "銀行2": "星展eco卡 M",
                "回饋2": "基本回饋2.55% 月消費20000加碼回饋0.45%",
                "綁定2": "\\n",
                "趴數2": "2.55%~3%",
            },
            {
                "銀行1": "台新Flygo M",
                "回饋1": "帳單金額少於5000=2.2%,帳單金額滿5000=3%\\n需Richart自動扣繳",
                "綁定1": "\\n",
                "趴數1": "2.2%or3%",
                #分隔線
                "銀行2": "兆豐Mega One 一卡通聯名卡 M",
                "回饋2": "\\n",
                "綁定2": "\\n",
                "趴數2": "2.88%",
            },
            {
                "銀行1": "中信Linepay卡 V,J",
                "回饋1": "\\n",
                "綁定1": "\\n",
                "趴數1": "2.8%",
                #分隔線
                "銀行2": "星展炫晶卡 V,M",
                "回饋2": "\\n",
                "綁定2": "\\n",
                "趴數2": "2.52%",
            },
            {
                "銀行1": "陽信曜晶卡 V\\n玉山Pi卡 M 2.5%華南享利樂活Combo(需申請電子帳單)\\n中信商旅鈦金卡M",
                "回饋1": "\\n",
                "綁定1": "\\n",
                "趴數1": "2.5%",
                #分隔線
                "銀行2": "彰銀商旅御璽卡V\\n中信Myway簽帳金融卡 M\\n中信英雄聯盟聯名卡或簽帳金融卡 M",
                "回饋2": "\\n",
                "綁定2": "\\n",
                "趴數2": "2.5%",
            },
            {
                "銀行1": "n",
                "回饋1": "\\n",
                "綁定1": "\\n",
                "趴數1": "\\n",
                #分隔線
                "銀行2": "n",
                "回饋2": "\\n",
                "綁定2": "\\n",
                "趴數2": "\\n",
            },
            {
                "銀行1": "n",
                "回饋1": "\\n",
                "綁定1": "\\n",
                "趴數1": "\\n",
                #分隔線
                "銀行2": "n",
                "回饋2": "\\n",
                "綁定2": "\\n",
                "趴數2": "\\n",
            },

						]    

            @keyword = params[:keyword]

            if @keyword.present?
                  @creditcards2.filter! do |creditcard|
                creditcard[:銀行1].include? @keyword
            end
        end
    end
end