class Creditcards1Controller < ApplicationController
    def index
        @creditcards1 = [
        {
          "銀行1": "華南i網購東奧卡",
          "回饋1": "每帳單週期回饋500,刷卡上限2500,到3/31",
          "綁定1": "台灣Pay",
          "趴數1": "22%",
          #分隔線
          "銀行2": "中信Yahoo聯名商務鈦金卡",
          "回饋2": "回饋為超贈點,每月回饋上限150,\\n每月刷1363,到3/31",
          "綁定2": "AP/GP/SP",
          "趴數2": "11%",
        },
        {
          "銀行1": "凱基魔Buy卡",
          "回饋1": "當月支付需滿3000及登錄\\n新戶3000~3333 8%\\n舊戶3000~5000 6%",
          "綁定1": "AP/GP",
          "趴數1": "新戶8%\\n舊戶6%",
          #分隔線
          "銀行2": "華南櫃買贏家生活卡",
          "回饋2": "每月上限2000,5%回饋上限100",
          "綁定2": "AP/GP",
          "趴數2": "5%\\n台灣Pay7%",
        },
        {
          "銀行1": "彰銀my樂卡",
          "回饋1": "1~3000=5.5%,3001~5000=8.5% ,5001~6000=6.5%\\n通路刷卡再多0.5%~2.5% ,\\n6Pay活動每月一號登錄",
          "綁定1": "台灣Pay",
          "趴數1": "5.5%~8.5%",
          #分隔線
          "銀行2": "遠銀樂家",
          "回饋2": "1~5000=5.5% , 5001~6666=3.5%",
          "綁定2": "台灣Pay",
          "趴數2": "3.5%~5.5%",
        },
        {
          "銀行1": "新光寰宇現金回饋卡",
          "回饋1": "25000內3%",
          "綁定1": "AP/GP/台灣Pay",
          "趴數1": "3%",
          #分隔線
          "銀行2": "台新玫瑰giving卡",
          "回饋2": "假日1~5000=5%,5001~166666=3%\\n平日1~5000=3%,超過5000=1%",
          "綁定2": "台灣Pay",
          "趴數2": "1%~5%",
        },
        {
          "銀行1": "一銀ileo",
          "回饋1": "舊戶1~5000=5.5%,5001~8333=3.5%\\n新戶1~5000=6.5%,5001~8333=4.5%\\nhttps://reurl.cc/KA8b3R\\n新戶為首次申辦ileo卡,需綁定ileo帳戶扣繳",
          "綁定1": "台灣Pay",
          "趴數1": "舊戶 3.5%~5.5%\\n新戶 4.5%~6.5%",
          #分隔線
          "銀行2": "一銀ileo",
          "回饋2": "1~8333 3.5%/4.5%",
          "綁定2": "AP/GP",
          "趴數2": "舊戶3.5%\\n新戶4.5% ",
        },
        {
          "銀行1": "永豐55688聯名卡",
          "回饋1": "搭車當日加碼5%每月上限600,可刷12000\\n回饋為T幣可折抵車資或台鐵高鐵電影院KTV費用",
          "綁定1": "\\n",
          "趴數1": "2%或7%",
          #分隔線
          "銀行2": "中信中華電信悠遊聯名卡",
          "回饋2": "\\n",
          "綁定2": "Hami Pay感應消費",
          "趴數2": "3%",
        },
        {
          "銀行1": "LineBank快點卡",
          "回饋1": "每月回饋上限500LP,刷16666",
          "綁定1": "\\n",
          "趴數1": "3%",
          #分隔線
          "銀行2": "星展eco卡",
          "回饋2": "1.5%無上限+1.5%每月回饋上限100 6666內3%,回饋滿100才能抵帳單\\n新增消費3000才有額外1.5%回饋",
          "綁定2": "\\n",
          "趴數2": "1.5%~3%",
        },
        {
          "銀行1": "永豐Sport卡",
          "回饋1": "指定通路額外加碼5%\\n需下載汗水不白流app偵測運動卡路里 指定通路5%每月回饋上限300)\\n1%(回饋無上限) + 1% (每月有卡路里回饋無上限) +1% (每月7000大卡上限300)",
          "綁定1": "\\n",
          "趴數1": "2%~3%",
          #分隔線
          "銀行2": "永豐大戶卡",
          "回饋2": "指定任務+1%，每月帳單上限1500\\n指定通路額外加碼+5%，每月帳單上限600\\n兩加碼需要大戶資格=每月存款高於10萬，\\n指定任務需申請電子帳單與大戶帳戶自動扣繳",
          "綁定2": "\\n",
          "趴數2": "1%或5%",
        },
        {
          "銀行1": "永豐幣倍卡",
          "回饋1": "原始回饋1%+行動支付2%\\n懂匯上限100/超匯上限300,帳單需新增消費2000",
          "綁定1": "AP/GP/SP/GarminPay/FitbitPay",
          "趴數1": "1%~3%",
          #分隔線
          "銀行2": "富邦J JU 卡",
          "回饋2": "J Points卡",
          "綁定2": "Linepay",
          "趴數2": "2%",
        },
        {
          "銀行1": "聯邦賴點卡",
          "回饋1": "回饋為Linepoint,加碼0.5%需辦理本行自動扣繳",
          "綁定1": "\\n",
          "趴數1": "1.5%+0.5%",
          #分隔線
          "銀行2": "花旗現金回饋PLUS鈦金卡",
          "回饋2": "回饋需滿300才能折抵帳單",
          "綁定2": "\\n",
          "趴數2": "2%",
        },
        {
          "銀行1": "玉山Pi卡",
          "回饋1": "回饋為Pi幣,可折抵水電或換成即享券",
          "綁定1": "\\n",
          "趴數1": "1.3%",
          #分隔線
          "銀行2": "聯邦理財型無限卡",
          "回饋2": "年費12000,每月可折抵新增消費1080",
          "綁定2": "\\n",
          "趴數2": "8%",
        },
        {
          "銀行1": "聯邦理財型白金卡",
          "回饋1": "年費5000,每月可折抵新增消費450",
          "綁定1": "\\n",
          "趴數1": "8%",
          #分隔線
          "銀行2": "\\n",
          "回饋2": "\\n",
          "綁定2": "\\n",
          "趴數2": "\\n",
        },

    ]

    @keyword = params[:keyword]

    if @keyword.present?
      @creditcards1.filter! do |creditcard|
        creditcard[:銀行1].include? @keyword
        end
      end
   end
 end