class Creditcards17Controller < ApplicationController
	def index
			@creditcards17 = [                       
        {
                "銀行1": "各家銀行",
                "回饋1": "街口繳費可參照綁定支付,\\n超商繳費可參照超商代收,\\nicash繳費在7-11",
                "綁定1": "繳費地點與支付APP\\n統一超商/全家/街口/Pi",
                "趴數1": "回饋%數\\n官網刷卡非一般消費",
                #分隔線
                "銀行2": " ",
                "回饋2": " ",
                "綁定2": " ",
                "趴數2": " ",
        },
        {
                "銀行1": "魔Buy卡",
                "回饋1": "當月指定支付需滿3000及登錄\\n新戶3000~3333 8%\\n舊戶3000~5000 6%",
                "綁定1": "街口",
                "趴數1": "舊戶 6% / 新戶 8%",
                #分隔線
                "銀行2": "陽信JCB哆啦A夢晶緻卡\\n彭大家族聯名卡",
                "回饋2": "舊戶加碼2% & 新戶/新卡友加碼5%每月回饋上限300",
                "綁定2": "街口/Linepay",
                "趴數2": "舊戶 3% 新戶/新卡友 6%",
        },
        {
                "銀行1": "一銀ileo卡",
                "回饋1": "每月刷卡上限8333,需ileo帳戶扣繳",
                "綁定1": "街口",
                "趴數1": "舊戶5% / 新戶6%",
                #分隔線
                "銀行2": "彰銀my樂卡",
                "回饋2": "需每月一號登錄",
                "綁定2": "街口",
                "趴數2": "3.5%or6.5%",
        },
        {
                "銀行1": "台新街口聯名卡",
                "回饋1": "回饋為街口幣 , 每月上限4000",
                "綁定1": "街口",
                "趴數1": "週三 6%",
                #分隔線
                "銀行2": "匯豐匯鑽卡",
                "回饋2": "3%回饋累積至5000點可抵10000刷卡金",
                "綁定2": "街口",
                "趴數2": "3%or6%",
        },
        {
                "銀行1": "玉山Ubear",
                "回饋1": " ",
                "綁定1": "街口",
                "趴數1": "3.8%",
                #分隔線
                "銀行2": "華南i網購",
                "回饋2": " ",
                "綁定2": "街口",
                "趴數2": "3.5%",
        },
        {
                "銀行1": "合庫藍兔",
                "回饋1": " ",
                "綁定1": "街口",
                "趴數1": "3%",
                #分隔線
                "銀行2": "中華電信聯名卡",
                "回饋2": "原卡回饋 3% + VIP加碼 0.5%~3%",
                "綁定2": "自動扣繳",
                "趴數2": "3%~6%",
        },
        {
                "銀行1": "彰銀My樂",
                "回饋1": "原始回饋0.5%+數位帳戶滿2萬 0.5%+電帳或帳戶扣繳1.5%",
                "綁定1": "自動扣繳",
                "趴數1": "最高2.5%",
                #分隔線
                "銀行2": "富邦數位生活",
                "回饋2": "市話沒有2%,但是可以合併帳單到手機帳單中",
                "綁定2": "自動扣繳",
                "趴數2": "2%",
        },
        {
                "銀行1": "一銀星璨\\nileo",
                "回饋1": " ",
                "綁定1": "自動扣繳 ",
                "趴數1": "2%",
                #分隔線
                "銀行2": "Hamipoint折抵",
                "回饋2": "可由Pchome P幣轉換",
                "綁定2": " ",
                "趴數2": " ",
        },

	]

	@keyword = params[:keyword]

	if @keyword.present?
		@creditcards17.filter! do |creditcard|
			creditcard[:銀行1].include? @keyword
			end
		end
    end
end