class Creditcards21Controller < ApplicationController
	def index
	@creditcards21 = [                       
        {
                "銀行1": "各家銀行",
                "回饋1": "街口繳費可參照綁定支付,\\n超商繳費可參照超商代收,\\nicash繳費在7-11",
                "綁定1": "繳費地點與支付APP\\nFamipay在全家繳費\\nhttps://nevent.family.com.tw/fami_creditcard/\\n橘子支付在7-11繳費\\nhttps://www.7-11.com.tw/service/monthly.aspx",
                "趴數1": "回饋%數",
                #分隔線
                "銀行2": " ",
                "回饋2": " ",
                "綁定2": " ",
                "趴數2": " ",
        },
        {
                "銀行1": "新光分期七卡",
                "回饋1": "每月回饋上限110元,需逐月登錄",
                "綁定1": "7-11繳費OPEN錢包",
                "趴數1": "11%",
                #分隔線
                "銀行2": "凱基魔Buy卡",
                "回饋2": "當月指定支付需滿3000及登錄 ,舊戶3000~5000 6%,新戶3000~3333 8%",
                "綁定2": "7-11繳費橘子支付",
                "趴數2": "舊戶6% / 新戶8%",
        },
        {
                "銀行1": "玉山U Bear",
                "回饋1": " ",
                "綁定1": "7-11繳費橘子支付",
                "趴數1": "3.8%",
                #分隔線
                "銀行2": "華南i網購",
                "回饋2": " ",
                "綁定2": "7-11繳費橘子支付",
                "趴數2": "3.5%",
        },
        {
                "銀行1": "新光寰宇現金回饋卡",
                "回饋1": "每月回饋上限100",
                "綁定1": "全家繳費Famipay",
                "趴數1": "10%",
                #分隔線
                "銀行2": "Linebank快點卡",
                "回饋2": "每月回饋上限500點",
                "綁定2": "全家繳費Famipay",
                "趴數2": "3%",
        },
        {
                "銀行1": "新光悠遊聯名卡",
                "回饋1": "每帳單月回饋上限300",
                "綁定1": "全家繳費Famipay",
                "趴數1": "2.1%",
                #分隔線
                "銀行2": " ",
                "回饋2": " ",
                "綁定2": " ",
                "趴數2": " ",
        },

	]

	@keyword = params[:keyword]

	if @keyword.present?
		@creditcards21.filter! do |creditcard|
			creditcard[:銀行1].include? @keyword
			end
		end
    end
end