class Creditcards22Controller < ApplicationController
	def index
	@creditcards22 = [                       
        {
                "銀行1": "各家銀行",
                "回饋1": " ",
                "綁定1": " ",
                "趴數1": "回饋%數",
                #分隔線
                "銀行2": " ",
                "回饋2": " ",
                "綁定2": " ",
                "趴數2": " ",
        },
        {
                "銀行1": "玉山Only卡",
                "回饋1": "每會員週期上限100萬紅利,每期帳單可折抵10000紅利",
                "綁定1": " ",
                "趴數1": "1.6%~3.2%",
                #分隔線
                "銀行2": "台新giving卡",
                "回饋2": "每月上限166666",
                "綁定2": " ",
                "趴數2": "假日刷卡 3%",
        },
        {
                "銀行1": "Linebank快點卡",
                "回饋1": "每月回饋上限500點",
                "綁定1": " ",
                "趴數1": "3%",
                #分隔線
                "銀行2": "永豐Sport卡",
                "回饋2": " ",
                "綁定2": " ",
                "趴數2": "2%",
        },
        {
                "銀行1": "花旗現金回饋PLUS鈦金卡",
                "回饋1": " ",
                "綁定1": " ",
                "趴數1": "2%",
                #分隔線
                "銀行2": "玉山Pi卡",
                "回饋2": "需單筆滿10000享12期0利率",
                "綁定2": " ",
                "趴數2": "1.5% + 12期0利率",
        },
        {
                "銀行1": "聯邦幸福M卡",
                "回饋1": "分期需登錄,1.5%回饋上限1000",
                "綁定1": " ",
                "趴數1": "1.5% + 12期0利率",
                #分隔線
                "銀行2": "匯豐現金回饋御璽卡",
                "回饋2": " ",
                "綁定2": " ",
                "趴數2": "1.22%",
        },
        {
                "銀行1": "永豐保倍",
                "回饋1": " ",
                "綁定1": " ",
                "趴數1": "1.2% + 12期0利率",
                #分隔線
                "銀行2": "永豐幣倍",
                "回饋2": " ",
                "綁定2": " ",
                "趴數2": "1.2%",
        },
        {
                "銀行1": "陽信曜晶",
                "回饋1": " ",
                "綁定1": " ",
                "趴數1": "1.2%",
                #分隔線
                "銀行2": "元大鑽金",
                "回饋2": " ",
                "綁定2": " ",
                "趴數2": "1.2%",
        },
        {
                "銀行1": "聯邦賴點卡",
                "回饋1": "分期需單筆壽險滿萬",
                "綁定1": " ",
                "趴數1": "1% + 12期0利率",
                #分隔線
                "銀行2": " ",
                "回饋2": " ",
                "綁定2": " ",
                "趴數2": " ",
        },

	]

	@keyword = params[:keyword]

	if @keyword.present?
		@creditcards22.filter! do |creditcard|
			creditcard[:銀行1].include? @keyword
			end
		end
    end
end