class Creditcards13Controller < ApplicationController
	def index
			@creditcards13 = [
            {
					"銀行1": "JCB悠遊聯名卡",
					"回饋1": "需登錄,排除永豐卡\\nhttps://reurl.cc/6DzrgO ",
					"綁定1": " ",
					"趴數1": "五六日搭捷運車資6折",
					#分隔線
					"銀行2": "JCB晶緻悠遊卡",
					"回饋2": "需逐月登錄,每月37000卡\\n回饋上限50",
					"綁定2": "自動加值",
					"趴數2": "10%",
			},
            {
					"銀行1": "新光新光三越聯名卡",
					"回饋1": "需逐月登錄,每月回饋上限50",
					"綁定1": "自動加值",
					"趴數1": "10%",
					#分隔線
					"銀行2": "聯邦幸福M卡",
					"回饋2": "悠遊卡/一卡通\\n每月回饋上限100,到2/28",
					"綁定2": "自動加值",
					"趴數2": "10%",
			},
            {
					"銀行1": "凱基悠遊聯名卡",
					"回饋1": "需逐月登錄,每月回饋上限50",
					"綁定1": "自動加值",
					"趴數1": "10%",
					#分隔線
					"銀行2": "國泰Cube icash卡",
					"回饋2": "每月回饋上限200點",
					"綁定2": "自動加值",
					"趴數2": "10%",
			},
            {
					"銀行1": "一銀icash聯名卡\\n宜蘭認同icash卡",
					"回饋1": "新卡icash自動加值 10% OP (核卡後90天內)",
					"綁定1": "自動加值",
					"趴數1": "10%",
					#分隔線
					"銀行2": "遠銀快樂卡\\nC’est Moi旅遊悠遊卡",
					"回饋2": "需逐月登錄,可跟JCB10%疊加",
					"綁定2": "自動加值",
					"趴數2": "5%",
			},
            {
					"銀行1": "一銀綠活卡",
					"回饋1": "悠遊卡/一卡通\\n需新增單筆滿千一般消費",
					"綁定1": "自動加值",
					"趴數1": "5%",
					#分隔線
					"銀行2": "合庫i享樂生活悠遊卡\\n合庫i運動卡悠遊卡",
					"回饋2": "當期帳單需新增一般消費2999,每月刷卡上限2000",
					"綁定2": "自動加值",
					"趴數2": "5%",
			},
            {
					"銀行1": "土銀icash2.0聯名卡",
					"回饋1": "每月回饋上限200",
					"綁定1": "自動加值",
					"趴數1": "5%",
					#分隔線
					"銀行2": "華南超級點數卡",
					"回饋2": "當期帳單需新增兩筆711或累積2711消費,每月上限100點",
					"綁定2": "自動加值",
					"趴數2": "5%",
			},
            {
					"銀行1": "國泰蝦皮購物ICASH聯名卡",
					"回饋1": "每月搭乘捷運/公車20次可以拿 50 openpoint",
					"綁定1": "需登錄",
					"趴數1": " ",
					#分隔線
					"銀行2": "國泰KOKO COMBO ICASH",
					"回饋2": "每月搭乘捷運/公車20次可以拿 50 openpoint",
					"綁定2": "需登錄",
					"趴數2": " ",
			},
            {
					"銀行1": "國泰KOKO (COMBO) 悠遊聯名卡",
					"回饋1": "每月搭乘捷運/公車20次可以拿50刷卡金",
					"綁定1": "需登錄",
					"趴數1": " ",
					#分隔線
					"銀行2": "如搭乘時扣款金額為0元(如搭乘台中公車前10公里免費)、或上/下車時其中一次僅感應卡片未扣款，則該次紀錄不列入本活動搭乘次數計算。",
					"回饋2": " ",
					"綁定2": " ",
					"趴數2": " ",
			},


	]

	@keyword = params[:keyword]

	if @keyword.present?
		@creditcards13.filter! do |creditcard|
			creditcard[:銀行1].include? @keyword
			end
		end
    end
end