class Friends2Controller < ApplicationController
    def index
      @friends2 = [
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "gogogo",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "冰糖",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "再買剁手",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "冠仲",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "BoBo993",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "Small瑄",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "阿绮",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "艾琳",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "Evita",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "文文寶貝",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "慢吞吞",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "慧珠",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "Libby",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "虹",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "西瓜好甜",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "寶寶",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "好事(花生圖片)",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "喵喵賺點",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "運氣",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "董小宛",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "陳喬巴",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "鄉民N號",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "Chueh",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "ching24",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "yellow",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "Vanessa",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "vicent yang",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "姜姜0.0",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "默默",
        },
        {
          "所在社群": "賺點數社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "蝦咪哈哈",
        },
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/04/08",
					"版友暱稱": "比奇堡",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/23",
					"版友暱稱": "ka/soka",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/20",
					"版友暱稱": "啊喵",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "喵喵",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "彼岸花",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "咖株",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "不了情",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "其清潔工",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "OM01",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "kok",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "Michelle",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "lletitia",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "邊緣人",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "uuooh",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "Kevin財富自由",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "有一天",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "Evita",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "HSIEH",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "zeo",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "Empress",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "想想",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "hua :)",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "潞潞",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "臻臻",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "Zoe wu",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "Ta",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "BoBo993",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "西蘭花",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "果果",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "小心肝",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "yellow",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "777",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "Susu",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "Ruby",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "小星",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "桃",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "信運賢",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "Tzu",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "Snoopy",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "Libby",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "比比",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "RoRo",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "好事/我是一棵樹",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "Shhhhhh.",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "Annie",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "angel",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "eateateat",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "魔術靈",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "酷",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "Grace",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "彼得。怕客",
				},
				{
					"所在社群": "賺點數社群",
					"入群日期": "2022/02/19",
					"版友暱稱": "麻糬雞腿",
				},
				{
					"所在社群": "分隔線",
					"入群日期": "9999/99/99",
					"版友暱稱": "我是小編",
				},
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "寶寶",
        },
        {
          "所在社群": "利己分享社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "阿绮",
        },
        {
          "所在社群": "利己分享社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "虹",
        },
        {
          "所在社群": "利己分享社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "黃小三",
        },
        {
          "所在社群": "利己分享社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "peacocktail",
        },
        {
          "所在社群": "利己分享社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "寶寶",
        },
        {
          "所在社群": "利己分享社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "好康通通來",
        },
        {
          "所在社群": "利己分享社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "Chueh",
        },
        {
          "所在社群": "利己分享社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "小鴻",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "yellow",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/04/08",
          "版友暱稱": "Gary",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/08",
          "版友暱稱": "BB媽",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/07",
          "版友暱稱": "小龍",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/07",
          "版友暱稱": "瑪莎熊熊",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/07",
          "版友暱稱": "叮叮",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/07",
          "版友暱稱": "小熊維尼",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/07",
          "版友暱稱": "HGFC",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/07",
          "版友暱稱": "陳喬巴",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/07",
          "版友暱稱": "海藍色",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/07",
          "版友暱稱": "阿宏",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/07",
          "版友暱稱": "TASI",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/06",
          "版友暱稱": "豬豬兒",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/05",
          "版友暱稱": "Sandy",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/05",
          "版友暱稱": "慧珠",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/04",
          "版友暱稱": "富士山",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/04",
          "版友暱稱": "默默",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/04",
          "版友暱稱": "鄉民N號",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/04",
          "版友暱稱": "Jaylin",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/04",
          "版友暱稱": "我有背後靈",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/04",
          "版友暱稱": "我想想",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "嗨嗨",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "lenko",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "楊小咩",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "小紫",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "惡魔Ace",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "王子/龍的傳人",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "虛幻現實",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "美美",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "Claire",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "CALL",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "粉圓子",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "Martin",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "小滿",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "奶茶",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "Rufen",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "Anja",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "John",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "小鴻",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "joker",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "鈺婷",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "Angel萱",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "肯尼是我",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "Anita",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "想換好多商品",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "吉娃娃",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "再買剁手",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "許某人",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "霉少女",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "微股利",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "Ci",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "Chueh",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "jeffrey",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "夏鴨",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "River",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "No name",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "Cookie",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "hsinghsing",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "花開荼靡",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "GN",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "00y",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "莉娜",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "ching24",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "蠽",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "Della",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "Aly",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "jjjj",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": " 阿醜",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "北鼻蝦嘟嘟",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "歐姆蛋",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "雪納瑞",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "互助分享",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "mmin",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "皮蛋",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "佳佳",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "choonsik",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "董小宛",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "仙",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "Clarice",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "Vanessa",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "我是樹",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "橋",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "Wilson",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "悠悠",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "好康通通來",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "䶁",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "幸運rain",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "崑瑋",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "敬琪",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "零",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "知否知否綠肥紅瘦",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "蝦米哈哈/米蝦蝦",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "H",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "猫猫",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "渡我",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "優米鴨",
        },
				{
          "所在社群": "利己分享社群",
          "入群日期": "2022/02/03",
          "版友暱稱": "古博毅",
        },

]

		@keyword = params[:keyword]

		if @keyword.present?
    @friends2.filter! do |friend|
        friend[:版友暱稱].include? @keyword
  end
end
		@friends2 = @friends2.first(12)
	end
end