class Inquires6Controller < ApplicationController
    def index
      @inquires6 = [
        {
          "題目": "台電運轉最久的風力發電機位於下列何處?",
          "答案": "澎湖",
        },
        {
          "題目": "為什麼大型風力發電的風機大多是三個葉片?",
          "答案": "讓風機的運轉得到最佳的平衡",
        },
        {
          "題目": "夏季電價的實施期間是?",
          "答案": "每年6-9月",
        },
        {
          "題目": "台灣四面環海、東北季風強勁相當適合風力發電，何者是發展風力發電的主要問題?",
          "答案": "適合安裝風機土地面積小，不容易開發",
        },
        {
          "題目": "請問架空輸電線路的鐵塔上，一串串像白色瓷碗的東西名稱是?",
          "答案": "礙子",
        },
        {
          "題目": "你們有聽說過智慧電表嗎?安裝後就可以紀錄用戶的用電量，進而調整用電習慣及達到減少電費支出的效果哦！以下關於智慧電表的敘述，何者為非?",
          "答案": "不改變用電行為即可減少電費",
        },
        {
          "題目": "有關電力與文化資產:電力博物館－台電北部展示館之敘述，何者正確。",
          "答案": "以上皆是",
        },
        {
          "題目": "有關電力與文化資產:三星蘭陽發電廠之敘述，何者正確。",
          "答案": "以上皆是",
        },
        {
          "題目": "變頻冷氣的好處，請選出錯誤敘述。",
          "答案": "更為耗電:啟動之後隨即產生強大電流，使壓縮機運轉最高速度並且固定不變。",
        },
        {
          "題目": "請問以下圖片的哪個部份是電力座標?甲－ＯＯＯＯＯ，乙－B6536 FE50",
          "答案": "甲為桿號，乙為電力座標(由 9-11 碼由英文和數字組成的編碼)。",
        },
        {
          "題目": "全台第一座路燈充電座位於何處?",
          "答案": "大安森林公園",
        },
        {
          "題目": "台灣2017年民生用電的電價，一度電約為多少錢?",
          "答案": "3.3元",
        },
        {
          "題目": "以下哪一個時段屬於住商型簡易時間電價的離峰時間?",
          "答案": "星期天下午14點~15點",
        },
        {
          "題目": "請問下圖電動輔助自行車(左)與電動自行車(右)的差異為何?",
          "答案": "電動輔助自行車一定要踩踏板電力才會輔助，電動自行車則不用踩踏板直接催油門即可。",
        },
        {
          "題目": "下列哪個選項為錯誤的用電觀念?",
          "答案": "常開冰箱門",
        },
        {
          "題目": "教育兒童正確的用電觀念具有重要性,請問下列何者敘述正確?",
          "答案": "濕手不要接觸或操作電氣設備。",
        },
        {
          "題目": "自備購物袋屬於綠色消費的哪一種行為?",
          "答案": "綠色消費",
        },
        {
          "題目": "請問因颱風造成停電要怎麼做呢?",
          "答案": "以上皆是(註解:通報後將有搶修人員進行搶修。)",
        },
        {
          "題目": "何種顏色的燈號代表備轉容量率小於或等於 6%?",
          "答案": "橘色",
        },
        {
          "題目": "低碳交通之敘述，何者正確?",
          "答案": "以上皆是(註解:低碳交通是指以適應低碳經濟模式為根本前提的，以實現交通可持續發展為基本理念的，以降低交通運輸工具溫室氣體排放為直接目標的低能耗、 低污染、低排放的交通發展模式。)",
        },
        {
          "題目": "下列投影機的敘述，何者較不正確?",
          "答案": "傳統投影機的水銀燈泡，壽命較 LED 燈長，也較省電",
        },
        {
          "題目": "如何防雷擊?",
          "答案": "以上皆是",
        },
        {
          "題目": "下列何者是全球暖化帶來的影響?",
          "答案": "夏季增長(註解:由於全球溫度上升，造成夏季高溫日子增長，冬季日子縮短。至於白日與夜晚時間的改變與全球暖化無關。)",
        },
        {
          "題目": "電熱水瓶如何省電使用?",
          "答案": "以上皆是。(註解:節能效率較差的電熱水瓶(開飲機)全天保溫加熱，1 年的耗電量可能超過冰箱，因此設定加熱定時功能、善用保溫壺、清除水垢、水量控制、水溫控制都能達到節能效果。)",
        },
        {
          "題目": "LED 燈泡的光通量單位為?",
          "答案": "流明(lm)",
        },
        {
          "題目": "何者是發展風力發電的優點?",
          "答案": "造成的汙染較低",
        },
        {
          "題目": "請問下列哪個淨水廠，由台灣電力公司與台水公司合作，於 2017 年選擇的水域型太陽能發電系統統?",
          "答案": "以上皆是(註解:台水公司為響應政府推動綠能政策，於 2016 年就布與台灣電力公司合作，共同設置水庫水域型太陽能發電系統，同時規劃中部以南的自來水淨水場或加壓站裝置太陽能板，並於 2017 年底選擇高雄市鳳山及拷潭淨水場、雲林縣林內淨水場、嘉義市公園淨水場、台南市中崙加壓站及永康水中心等 6 處的清、配水池頂設置太陽光電發電設備。)",
        },
        {
          "題目": "何者是「冷氣機」省電的正確方式?",
          "答案": "以上皆是",
        },
        {
          "題目": "請問這個圖案是什麼的吉祥物呢?貓頭鷹頭上有電力圖樣、肚子有台電標示。",
          "答案": "台電用電建檢中心",
        },
        {
          "題目": "如何使用電扇可達到省電的效果?",
          "答案": "以上皆是",
        },
        {
          "題目": "廚房用電安全，下列敘述何者錯誤?",
          "答案": "多個插頭可插在同一個轉接頭上，使用較方便",
        },
        {
          "題目": "有關使用電磁爐的常見節能手法，何者正確?",
          "答案": "以上皆是",
        },
        {
          "題目": "全台最長的配電線路在哪裡?",
          "答案": "台東",
        },
        {
          "題目": "台灣電力 App 有下列哪些服務?",
          "答案": "以上皆是",
        },
        {
          "題目": "如何申辦住商型簡易時間電價?",
          "答案": "以上皆是",
        },
        {
          "題目": "全台首座離島大型微電網，位於何處?",
          "答案": "澎湖",
        },
        {
          "題目": "關於「節能標章」的敘述，下列何者錯誤?",
          "答案": "代表該產品的價格為國際認可",
        },
        {
          "題目": "觸電事故的發生原因有哪些?",
          "答案": "以上皆是",
        },
        {
          "題目": "下列哪個選項為「節能減碳十大無悔措施」?",
          "答案": "以上皆是",
        },
        {
          "題目": "季節電價的敘述，何者錯誤?",
          "答案": "非夏月的電價比夏月高",
        },     
        {
          "題目": "請問台電推出的電力即點APP，當中的尋寶遊戲，尋寶期間是什麼時候?",
          "答案": "24小時",
        },
        {
          "題目": "今(107)年是台電投入淨灘活動的第 25 年，台電藉由淨灘活動向民眾進行環教宣導，請問 107 年於哪些地方舉辦了淨灘活動呢?",
          "答案": "以上皆是",
        },
        {
          "題目": "如何避免觸電?",
          "答案": "以上皆是",
        },
        {
          "題目": "「潮汐發電」的發電原理是什麼?",
          "答案": "利用海水的水位差",
        },
        {
          "題目": "根據世界銀行公布的《2017經商環境報告》(Doing Business 2017)，請問台灣取得世界排名第幾名?",
          "答案": "二名(註解:根據世界銀行今年公布的《2017經商環境報告》(Doing Business 2017)，台灣在電力取得表現領先歐美等先進國家，排名世界第 2，且是台灣連續 3 年在此項目獲得第 2 名，台電表現獲得肯定。)",
        },
        {
          "題目": "DC風扇是什麼?",
          "答案": "以上皆是",
        },
        {
          "題目": "什麼是靜電?",
          "答案": "以上皆是",
        },
        {
          "題目": "因應豪雨造成的停電災情，下列事項何者錯誤?",
          "答案": "若家電有泡水或受潮情況，可直接插電使用。",
        },
        {
          "題目": "請問下列使用熱水器方法，對於節能具有幫助?",
          "答案": "以上皆是",
        },
        {
          "題目": "請問電費帳單逾期導致無法到超商繳款了，該怎麼繳?",
          "答案": "跑台電 / 台灣電力 App- 條碼繳費 / 行動支付 App 繳費",
        },     
        {
          "題目": "關於「節能標章」的敘述，下列何者錯誤?",
          "答案": "代表該產品的價格為國際認可",
        },
        {
          "題目": "下列敘述何者為電氣火災前的前兆?",
          "答案": "以上皆是",
        },
        {
          "題目": "下列何者為變頻式冷氣機的優點?",
          "答案": "以上皆是",
        },
        {
          "題目": "下列選購冷氣機的方式，何者不正確? 1.選購「能源效率分級標示」級數小、效率高之冷氣機。",
          "答案": "選購低「CSPF 值」的冷氣機",
        },
        {
          "題目": "第一座民眾自己設計的創意造型電塔真的實現了！外型以「生」古字為意象，象徵台電努力提供生生不息的穩定電力。請問上述電塔位於何處?",
          "答案": "宜蘭花蓮交界和平溪出海口",
        },
        {
          "題目": "106 年 1 月立法院三讀通過《電業法》，修法版本將台電公司一分為三，實踐能源轉型與台電轉型目標。下列何者為轉型後的單位?",
          "答案": "以上皆是(註解:電業法要求台電於修法後 6 至 9 年內轉型為控股母公司，其下成立發電及輸配售電 2 家子公司)",
        },
        {
          "題目": "請問台電公司是政府哪一個部會所屬的國營事業機構?",
          "答案": "經濟部",
        },
        {
          "題目": "德國漢堡所推出首棟的生物智慧住宅，請問是用結合哪種生物所設計的建築?",
          "答案": "綠藻",
        },
        {
          "題目": "下圖是什麼標章?綠色 GREEN POWER",
          "答案": "綠色電力標章",
        },
        {
          "題目": "下列何種標章與宣導節能減碳概念無關?",
          "答案": "奈米標章",
        },     
        {
          "題目": "台電文字客服提供哪些服務?",
          "答案": "以上皆有",
        },
        {
          "題目": "下列何者為綠色設計的準則?",
          "答案": "以上皆是",
        },
        {
          "題目": "電度表所記錄的電度(kWh)是怎麼計算的呢?",
          "答案": "電功率 X 使用時間",
        },
        {
          "題目": "裝置 LED 燈之敘述何者正確?",
          "答案": "避免將 LED 燈泡包裝在密閉的燈具或空間內，因散熱不易而導致過熱。",
        },
        {
          "題目": "下列何者是我們國家為了減少臭氧層稀薄所做的努力?",
          "答案": "禁用海龍滅火器",
        },
        {
          "題目": "為什麼資源回收可以達到節能減碳的目的?",
          "答案": "資源再利用可以減少能源消耗",
        },
        {
          "題目": "何謂低碳能源?",
          "答案": "以上皆是",
        },
        {
          "題目": "家中冷氣的挑選方法以下何者為非?",
          "答案": "選擇「能源效率分級標示」級數大的冷氣",
        },
        {
          "題目": "以下哪個選項為政府輔導企業施行綠色採購及宣導綠色採購之標章?",
          "答案": "以上皆是",
        },
        {
          "題目": "為什麼冷氣機都是裝在上面，甚至比人還高?",
          "答案": "因熱脹冷縮，冷空氣會下沉。",
        },     
        {
          "題目": "台電公司公眾服務處自100年起舉辦之「我愛地球媽媽行動故事教育推廣」(下圖標誌)，曾針對哪些對象舉辦活動宣導節能教育呢?",
          "答案": "以上皆是",
        },
        {
          "題目": "桃園市環保局推動的示範計畫，將原本用來蓄水的埤塘，結合光電技術，進行能源轉型，請問該計畫主要是發展哪種能源?",
          "答案": "太陽能",
        },
        {
          "題目": "請問哪個縣市的政府提供當地花農大規模的節電燈具補助，透過農業夜照的特色來創造在地節電文化?",
          "答案": "彰化縣",
        },
        {
          "題目": "下列哪種能源的產生方法符合節能減碳?",
          "答案": "風力發電",
        },
        {
          "題目": "想買電暖扇，小型的一定比較省電嗎?",
          "答案": "不一定，看使用狀況",
        },
        {
          "題目": "全臺第一座太陽能高鐵車站為何?",
          "答案": "苗栗站",
        },
        {
          "題目": "電腦機房使用時間較長，下列何項措施對電腦機房使用管理較不適當?",
          "答案": "機房設定較低溫度",
        },
        {
          "題目": "一般辦公室的用電尖峰為每天上午 8 點至下午 6 點，上班族有哪些方法可以落實節能省電?",
          "答案": "以上皆是",
        },
        {
          "題目": "冷氣最佳溫度設定在幾度間，並搭配電扇的使用最適當?",
          "答案": "26~28°C",
        },
        {
          "題目": "利用微藻供熱的生物智慧住宅(又稱為 BIQ )，有哪些好處呢?",
          "答案": "以上皆是",
        },     
        {
          "題目": "下列哪種行為「不符合」綠色消費的原則?",
          "答案": "可分解的環保塑膠袋，用完即可丟棄",
        },
        {
          "題目": "停電安全須知，下列何者正確?",
          "答案": "以上皆是",
        },
        {
          "題目": "下列哪些產品需要張貼強制性能源效率標示?",
          "答案": "以上皆是",
        },
        {
          "題目": "下列何者符合綠建築「基地保水指標」的設計?",
          "答案": "增加雨水的貯留滲透設計",
        },
        {
          "題目": "如何消除靜電?",
          "答案": "以上皆是",
        },
        {
          "題目": "請問下列圖檔為選項中哪個單位?綠色線台灣上面有 T-REC",
          "答案": "國家能源憑證中心",
        },
        {
          "題目": "全球首座完全仰賴太陽能發電的國際機場在哪個國家?",
          "答案": "印度",
        },
        {
          "題目": "1977 年首先推出藍天使環保標章的是哪一個國家?",
          "答案": "德國",
        },
        {
          "題目": "以下針對電瓶的敘述，何者正確?兩格漫畫「電瓶是什麼?」",
          "答案": "以上皆是",
        },
        {
          "題目": "空調設定溫度每調高 1°C，約可節省空調電力 6%，全民響應將可節約 10 億度電，相當於減少幾噸二氧化碳排放?",
          "答案": "約 62 萬頓",
        },     
        {
          "題目": "一般俗稱的電磁波是屬於何種輻射?",
          "答案": "非游離輻射",
        },
        {
          "題目": "下列哪個選項非省電的方式?",
          "答案": "冷氣溫度設定最低，降低室內溫度",
        },
        {
          "題目": "下面有關碳足跡標章與減碳之目標何者「錯誤」?",
          "答案": "碳足跡標章主要給廠商證明用",
        },
        {
          "題目": "變頻式電梯較傳統式電梯省電達多少%?",
          "答案": "30%",
        },
        {
          "題目": "聯合國發起的世界水日為每一年哪一天?",
          "答案": "3月22日",
        },
        {
          "題目": "台電於哪一個電廠已進行多年的生態復育工作，並建構「生態綠能環境教育」設施場所，在 2016 年 5 月 4 日取得環保署環境教育設施場所的認證，推動並將該電廠轉型為以友善環境及環境教育為核心之『生態綠能電廠』?",
          "答案": "萬大發電廠",
        },
        {
          "題目": " 圖片畫面中為台電的哪個 APP，提供用戶電費繳交及即時查詢的功能?台灣電力三張 APP 內截圖照",
          "答案": "台灣電力",
        },
        {
          "題目": "碰到搬家時，可以如何繳交電費?",
          "答案": "以上皆是",
        },
        {
          "題目": "汽車的電瓶沒電時，可透過另一部車子進行接電，請問以下步驟何者錯誤?圖片電瓶沒電可靠接電?藍車要出發，黃車電瓶沒電發不動",
          "答案": "以串聯方式，即蓄電池的正極接負極的作法，將兩車之蓄電池互相聯接",
        },
        {
          "題目": "以下和者非台灣電力具有的服務功能?",
          "答案": "申請節電獎勵活動",
        },     
        {
          "題目": "有關電力與文化資產:尋訪全台最老電廠－后里發電廠之敘述，何者正確。",
          "答案": "以上皆是",
        },
        {
          "題目": "為了節能減碳，家中的老舊電燈可更換為何種?",
          "答案": "LED 燈泡",
        },
        {
          "題目": "請問台電公司的哪個網站，可以幫助家庭用戶了解用電比例，並且與全體住宅用戶進行比較?",
          "答案": "用電健檢中心",
        },
        {
          "題目": "請問「利用海水的水位差發電」是何種發電的原理?",
          "答案": "潮汐發電",
        },
        {
          "題目": "近年來大型風力發電技術進步快速，請問下列何者不是風力發電的主要特點?",
          "答案": "較太陽能、地熱的發電成本高",
        },
        {
          "題目": "下列哪個選項為冷氣機的正確安裝觀念?",
          "答案": "以上皆是",
        },
        {
          "題目": "有關購物方面的節能減碳敘述何者正確?",
          "答案": "以上皆是",
        },
        {
          "題目": "哪些東西上有電力座標可精準定位呢?",
          "答案": "以上皆是",
        },
        {
          "題目": "以下圖片為台電推出的哪個 APP 畫面?台灣電力 APP 截圖畫面",
          "答案": "台灣電力",
        },
        {
          "題目": "媒體報導太陽能、風力、火力核能發電的「裝置容量」，關於裝置容量的敘述何者正確?",
          "答案": "以上皆是",
        },     
        {
          "題目": "最早有環保標章是下列哪個國家?",
          "答案": "德國",
        },
        {
          "題目": "全國第 1 個綠能環保示範園區，稱為北台灣的「能源之丘」請問在哪個縣市?",
          "答案": "台北市",
        },
        {
          "題目": "地球日即每年的 4 月 22 日，是一項世界性的環境保護活動。下列何者作法可為響應地球盡一分心力?",
          "答案": "以上皆是",
        },
        {
          "題目": "輸電鐵塔上像白色瓷碗的東西是什麼?",
          "答案": "礙子",
        },
        {
          "題目": "變頻家電產品，請選出正確敘述?",
          "答案": "以上皆是",
        },
        {
          "題目": "請問台中大甲溪發電廠馬鞍後池目前發展為何種發電型態?",
          "答案": "水上光電站",
        },
        {
          "題目": "下列哪個地區的住家最適合裝太陽能熱水器?",
          "答案": "高雄",
        },
        {
          "題目": "有關電力與文化資產:美濃竹仔門電廠之敘述，何者正確。",
          "答案": "以上皆是",
        },
        {
          "題目": "台中大甲溪發電廠馬鞍後池發展為水上光電站，下列敘述何者錯誤?",
          "答案": "水上光電是指水力發電結合風力發電的發電形式",
        },
        {
          "題目": "有關家裡冷氣的設置與使用，以下哪一種作法不能提高冷氣的效率?",
          "答案": "冷氣安裝位置靠近地板處",
        },       
        {
          "題目": "下列何者是綠色產品的衡量指標?",
          "答案": "低污染、可回收、省資源",
        },
        {
          "題目": "颱風停電時，可採取以下何種作法?",
          "答案": "以上皆是",
        },
        {
          "題目": "短暫離開電腦一下，建議要讓電腦在什麼狀態下較省電?",
          "答案": "待機",
        },
        {
          "題目": "繳納電費方式包含下列何者?",
          "答案": "以上皆是",
        },
        {
          "題目": "有關節能省電的敘述何者正確?",
          "答案": "以上皆是",
        },
        {
          "題目": "請問哪一面的玻璃及牆受到陽光照射，會造成很大的冷氣負載?",
          "答案": "西面",
        },
        {
          "題目": "電器使用時，應如何整理電線較好?",
          "答案": "無需細綁，但要注意有無被重物壓著",
        },
        {
          "題目": "複循環發電敘述，何者正確?",
          "答案": "以上皆是",
        },
        {
          "題目": "請問台中龍井電廠是屬於哪種類型的太陽光電系統?",
          "答案": "地面型",
        },
        {
          "題目": "有關電力與文化資產:臺灣水力發電歷史之敘述，何者正確。",
          "答案": "以上皆是",
        },
        {
          "題目": "拔插頭真的會省電嗎?",
          "答案": "有待機電力的電器，拔插頭後可以省電",
        },
        {
          "題目": "列何者不是台電所推出之 APP 系統?",
          "答案": "路況快易通",
        },
        {
          "題目": "哪個因素會影響手機耗電?",
          "答案": "以上皆是",
        },
        {
          "題目": "節能標章能源效率分級 1 至 5 級，哪一等級最省電?",
          "答案": "1級",
        },
        {
          "題目": "LED 燈在正常使用下最少可用多久?",
          "答案": "10000小時",
        },
        {
          "題目": "下圖是什麼網站的標誌?",
          "答案": "台電綠網",
        },
        {
          "題目": "請問以下圖案為何項標章?",
          "答案": "綠色工廠標章",
        },
        {
          "題目": "電氣故障時，應注意下列哪些事項?",
          "答案": "以上皆是",
        },
        {
          "題目": "電的產生原理，包含哪些?",
          "答案": "以上皆是",
        },
        {
          "題目": "同等級的桌上型電腦和筆記型電腦何者比較耗電?",
          "答案": "桌上型電腦",
        },     
        {
          "題目": "下列關於除濕機的敘述何者錯誤?",
          "答案": "購買越大台越好",
        },
        {
          "題目": "每年徹底清除燈具之灰塵，可增加照明度幾%?",
          "答案": "25%",
        },
        {
          "題目": "採用太陽能發電須考量哪些因素?",
          "答案": "以上皆是",
        },
        {
          "題目": "碳標籤是由哪個單位核發?綠色腳掌圖樣上頭寫CO2 Carbon Footprint Taiwan EPA",
          "答案": "環保署",
        },
        {
          "題目": "2020 台電公司宣傳節電態度的標語是?",
          "答案": "我節電 我驕傲",
        },
        {
          "題目": "如有人觸電，而且電線還在他身上，哪種處理方式有誤?",
          "答案": "搶時間救人，直接把觸電者拉離電源",
        },
        {
          "題目": "若使用一般 100 瓦家用電視，1 度電可以看幾個小時?",
          "答案": "10 小時",
        },
        {
          "題目": "關於「冷氣機」如何省電的敘述，下列何者正確?",
          "答案": "以上皆是",
        },
        {
          "題目": "如何擺放電暖器?",
          "答案": "以上皆是",
        },
        {
          "題目": "使用暖爐等會發熱的電器時，要注意哪些事情?",
          "答案": "以上皆是",
        },     
        {
          "題目": "餐飲業要配合推動綠色產業，使用下列哪一種材料較「不恰當」?",
          "答案": "進口食材",
        },
        {
          "題目": "臺灣太陽光電發電系統結構與材料的使用期限應以幾年較為合適?",
          "答案": "20 年",
        },
        {
          "題目": "冰箱儲存食物量以幾分滿最省電?",
          "答案": "8 分滿",
        },
        {
          "題目": "小鳥兩隻腳位於同一條電線上，為什麼不會觸電?",
          "答案": "因為電壓相同",
        },
        {
          "題目": "我國能源效率分級標示分成幾級?",
          "答案": "5 級",
        },
        {
          "題目": "空氣中懸浮粒子是一個一個的小小粒子，下列何者是微粒的物質?",
          "答案": "花粉",
        },
        {
          "題目": "經濟部推動之「綠色工廠」制度，其中包含清潔生產認證，以下何者為清潔生產範疇?",
          "答案": "綠色管理與社會責任",
        },
        {
          "題目": "以下各燈泡發光效率如下，何者較省電?",
          "答案": "LED 燈泡 70-110 流明",
        },
        {
          "題目": "下列何者發電廠蘊藏豐富的水力資源，且轄有德基分廠、青山分廠、谷關分廠及天輪分廠...等?",
          "答案": "大甲溪發電廠",
        },
        {
          "題目": "世界上最大的建築整合風力發電系統位於哪個國家?",
          "答案": "美國",
        },     
        {
          "題目": "環保署規定車輛怠速在一般情況下不得超過多久?",
          "答案": "3 分鐘",
        },
        {
          "題目": "關於冷氣設定溫度，何種狀況下較省電?",
          "答案": "提高溫度",
        },
        {
          "題目": "下列何者屬於節能的正確做法?",
          "答案": "使用省電燈泡取代傳統燈泡",
        },
        {
          "題目": "對於電梯的使用方式，下列何者無法有效的節約能源?",
          "答案": "頻繁的搭乘電梯上下樓",
        },
        {
          "題目": "下列哪一個拔除插頭的行為較為適當?",
          "答案": "拔插頭要握好握滿，從頭拔起",
        },
        {
          "題目": "關於「減少」電器使用時數的原因，下列哪個選項正確?",
          "答案": "以上皆是",
        },
        {
          "題目": "下列何種措施不是有效節約用電的方法?",
          "答案": "螢光燈管兩端有黑影圈仍繼續使用",
        },
        {
          "題目": "洗烘衣機可以如何省電?",
          "答案": "以上皆是",
        },
        {
          "題目": "節電小撇步，何者正確。",
          "答案": "以上皆是",
        },
        {
          "題目": "請問下列何者屬於再生能源的發電?",
          "答案": "水力發電",
        },     
        {
          "題目": "下列哪一行為無法減少家中電器的待機電力時間?",
          "答案": "關好門窗",
        },
        {
          "題目": "判斷省電燈泡的條件為何?",
          "答案": "發光效率越高越省電",
        },
        {
          "題目": "地熱發電的特性，何者正確?",
          "答案": "以上皆是",
        },
        {
          "題目": "家中社區可採哪種方法節能減碳?",
          "答案": "以上皆是",
        },
        {
          "題目": "下列哪一個不是智慧電表(Smart Meter)的功能?",
          "答案": "可以自動幫用戶節電",
        },
        {
          "題目": "德國佛萊堡透過都市針灸法，運用於都市設計與更新，蒐集社會面、經濟面及環境生態面的症狀，正確診斷問題並找出病因，請問下列何者為佛萊堡運用都市針灸法推動的節能治療方式?",
          "答案": "以上皆是",
        },
        {
          "題目": "下列何種措施不是有效節約用電的方法?",
          "答案": "將 5 瓦以下的 LED 出口警示燈汰換成傳統式 16 瓦出口警示燈。",
        },
        {
          "題目": "選購延長線要注意哪些事項?",
          "答案": "有商品安全標章，有標示額定電壓、電流、容量及廠商資訊，且具有自動斷電保護裝置",
        },
        {
          "題目": "請問 2020 我節電我驕傲的活動大使為?",
          "答案": "張秝芸",
        },
        {
          "題目": "以下何種顏色的燈號代表備轉容量是小於 90 萬千瓦?",
          "答案": "紅色",
        },     
        {
          "題目": "下列何者為挑選省電冷氣的注意事項?",
          "答案": "以上皆是",
        },
        {
          "題目": "近年來能源轉型趨勢漸起，民眾逐漸重視環保與節能，台電的訂價策略導入「使用者付費」機制，採累進計價，將小用戶的電價分為幾個級距?",
          "答案": "6個",
        },
        {
          "題目": "傳統電度表的鋁盤轉動越快，代表電力使用的狀況為何?",
          "答案": "電功率消耗越大",
        },
        {
          "題目": "將百葉窗安裝在窗戶外面，就居住節能方面來說，主要目的為何?",
          "答案": "直接阻擋太陽的光與熱，避免進入屋內",
        },
        {
          "題目": "目前車輛排氣檢測的項目不包含下列哪個選項?",
          "答案": "氫氧化合物(H20)",
        },
        {
          "題目": "冷氣溫度調高 1 度大約可省多少空調用電?",
          "答案": "0.06",
        },
        {
          "題目": "開冷氣又開電扇，是不是比較浪費電?",
          "答案": "否，兩個配合一起使用，冷氣不需開太冷也可讓室內溫度下降",
        },
        {
          "題目": "下列何者非回收玻璃瓶主要目的?",
          "答案": "防止做為攻擊武器",
        },
        {
          "題目": "下列何者行為可能造成電器損壞?",
          "答案": "以上皆是",
        },
        {
          "題目": "下列何種使用方法，可有效減少冰箱的耗電量?",
          "答案": "要放進去的食物先冷卻再放進去。",
        },     
        {
          "題目": "下列有關辦公室秋冬季節能措施，何者為錯誤的?",
          "答案": "秋冬期間，增加白天的空調主機運轉台數",
        },
        {
          "題目": "太陽能是一種綠色的能源，以下何者無法作為太陽能相關產品?",
          "答案": "瓦斯爐",
        },
        {
          "題目": "發生電器火災怎麼辦?",
          "答案": "以上皆是",
        },
        {
          "題目": "下列何者「不是」目前國際性環保的話題?",
          "答案": "垃圾清潔費用隨袋徵收",
        },
        {
          "題目": "雙手潮濕為什麼容易觸電?",
          "答案": "皮膚潮濕時，電阻變小，流經人體的電流也就越大",
        },
        {
          "題目": "下列關於「綠色採購」的敘述，何者正確?",
          "答案": "正式立法，政府機構得優先採購。",
        },
        {
          "題目": "有關一般家庭住宅用電電價的敘述何者錯誤?",
          "答案": "無論使用幾度電，電價均相同",
        },
        {
          "題目": "今天沒有要使用電腦了，要讓電腦在什麼狀態比較省電?",
          "答案": "關機",
        },
        {
          "題目": "一般家用電價採用級距累進計費，以下何者為非?",
          "答案": "在白天尖峰時間用電比較貴，晚上用電比較便宜",
        },
        {
          "題目": "以下何種為電動汽車的特性?",
          "答案": "以上皆是",
        },     
        {
          "題目": "冰箱有哪些省電方法?",
          "答案": "以上皆是",
        },
        {
          "題目": "請問以下哪一種吹風機使用方式較為不佳?",
          "答案": "與其他高耗電家電(如:烤箱、微波爐、電磁爐等)插在同一延長線或插座上同時使用",
        },
        {
          "題目": "台灣最高的太陽能發電站位於何處?",
          "答案": "玉山北峰",
        },
        {
          "題目": "電子式安定器燈具的優點，何者正確?",
          "答案": "以上皆是",
        },
        {
          "題目": "有關電力與文化資產:日治時期亞洲最大水力電廠-南投大觀發電廠之敘述，何者正確。",
          "答案": "以上皆是",
        },
        {
          "題目": "1 度電的意思是?",
          "答案": "1000 瓦的電使用一小時",
        },
        {
          "題目": "以下關於冰箱的敘述何者錯誤?",
          "答案": "為保持冷藏效果，食物儲存量越多越好",
        },
        {
          "題目": "請問有關家庭安全用戶措施，下列何者觀念正確?",
          "答案": "使用家電時有完整可靠的電源線插頭。",
        },
        {
          "題目": "台電為發展在地化能源教育，今(107)年成立「能源暨環境教育推廣種子工作坊」，設計環境教育課程，以哪個發電廠為基地，舉辦「能源小博士」環境教育推廣營?",
          "答案": "桂山發電廠",
        },
        {
          "題目": "什麼是一度電?",
          "答案": "1000 瓦的電器用了一個小時",
        },     
        {
          "題目": "以下關於「冰箱」的敘述，下列何者錯誤?",
          "答案": "為保持冷藏效果，食物儲存量越多越好。",
        },
        {
          "題目": "下列何者為「世界環境日」的日期?",
          "答案": "6 月 5 日",
        },
        {
          "題目": "世界上第一部風力發電機是由下列何人所發明??",
          "答案": "保羅·拉·庫爾",
        },
        {
          "題目": "何者為裝設太陽光電的優點?",
          "答案": "以上皆是",
        },
        {
          "題目": "買老屋建議更換電線的原因為以下何者?",
          "答案": "以上皆是",
        },
        {
          "題目": "下列何者是造成臺灣颱風強度增加的原因?",
          "答案": "地球暖化",
        },
        {
          "題目": "經濟部能源局所提出的我國新能源政策目標有什麼?",
          "答案": "以上皆是",
        },
        {
          "題目": "台電會定期檢查電表，並視情況更換老舊電表，請問更換電表時會跟用戶收取多少費用?",
          "答案": "免費",
        },
        {
          "題目": "以下哪一個是台灣大部分的水力發電形式?",
          "答案": "慣常式水力發電",
        },
        {
          "題目": "下列哪種發電方式是利用高度差所產生的能量發電?",
          "答案": "水力發電",
        },       
        {
          "題目": "下列何種情況仍會耗電?",
          "答案": "關掉的電視",
        },
        {
          "題目": "碳足跡是指每個人、每個家庭或每家公司日常釋放的溫室氣體數量(以二氧化碳即CO2的影響為單位)，用以衡量人類活動對環境的影響。可透過下列哪種方式，減少碳足跡數量，進而保護我們生活的大地。",
          "答案": "以上皆是",
        },
        {
          "題目": "電號標示於電費繳費通知單的哪一個地方?",
          "答案": "左上方",
        },
        {
          "題目": "對一般住宅及小商店用戶，台電每幾個月進行抄表收費?",
          "答案": "2個月一次",
        },
        {
          "題目": "台灣大約 97% 的建物都是舊建築，哪種行為能改造老屋變身成節能省電的綠建築?",
          "答案": "以上皆是",
        },
        {
          "題目": "如何幫房子降低室內溫度?",
          "答案": "以上皆是",
        },
        {
          "題目": "台電公司最近推動「行動支付」的繳費方式，請問一般住戶可透過哪種支付工具繳交電費單?",
          "答案": "以上皆是",
        },
        {
          "題目": "請問下列哪個家用電器的待機電力最高?",
          "答案": "收錄音機",
        },
        {
          "題目": "我國住宅及商業用電所消耗電力約佔總用電量的多少?",
          "答案": "30%",
        },
        {
          "題目": "具有低汙染的燃料電池，可應用在哪些領域中?",
          "答案": "以上皆是",
        },
        {
          "題目": "每關一次冰箱門，壓縮機需多運轉幾分鐘才能恢復低溫狀態?",
          "答案": "10分鐘",
        },    
        {
          "題目": "以下何種原因可能造成電線走火?",
          "答案": "以上皆是",
        },
        {
          "題目": "有關家中電器使用的方法，以下哪一種作法不能節省能源?",
          "答案": "讓電熱水瓶長時間處於開啟狀態",
        },  
        {
          "題目": "開冷氣應搭配何種行為較省電?",
          "答案": "打開電扇",
        },
        {
          "題目": "碳足跡標章上的數值意義為何?",
          "答案": "數值大代表溫室氣體含量越高",
        },  
        {
          "題目": "海洋溫差發電的發電原理為以下哪個選項?",
          "答案": "運用海面和海底的水溫不同",
        },
        {
          "題目": "下列準備飲用熱水方式何者最耗電?",
          "答案": "使用電熱水瓶，水溫降低後會自動加熱",
        },  
        {
          "題目": "下列何項行為對環境保護是正面的?",
          "答案": "買有環保標章商品",
        },
        {
          "題目": "全台第一座造型輸電鐵塔在哪個城市?",
          "答案": "屏東",
        },
        {
          "題目": "請問以下哪一種洗衣方式為較差的用電效率方式?",
          "答案": "衣服髒了就丟洗衣機洗，不用在意衣物量",
        },   
        {
          "題目": "台電所推動的節電獎勵活動抽獎，只要登錄之電號，當期用電每節省 1 度，就可獲得多少的獎勵金?",
          "答案": "0.6",
        }, 
        {
          "題目": "4 月 22 日是環境保護的重要日子，請問這一天又稱為什麼日?",
          "答案": "世界地球日",
        }, 
        {
          "題目": "辦公室內的影印機及印表機長時間不使用時應如何處理較節能?",
          "答案": "關閉電源並拔掉插頭",
        }, 
        {
          "題目": "無火焰但功率高的 IH 智慧感應爐之特性為何?",
          "答案": "以上皆是",
        },   
        {
          "題目": "下面有關碳足跡的敘述，何者「錯誤」?",
          "答案": "僅只是二氧化碳排放",
        },
        {
          "題目": "關於家庭電力知識，以下何者內容正確?",
          "答案": "用符合國家標準、規格型號合適的電器、插座。",
        },
                                                                                                                                                                                                       
    ]

    @keyword = params[:keyword]

    if @keyword.present?
        @inquires6.filter! do |inquire|
           inquire[:題目].include? @keyword
    end
  end
end
end