class InquiresController < ApplicationController
    def index
      @inquires = [
        {
          "題目": "真武百煉傳那種不是珠仙的屬性？",
          "答案": "防禦",
        },
        {
          "題目": "真武百煉傳聚靈妖丹可在哪個關卡中獲得?",
          "答案": "斥天谷",
        },
        {
          "題目": "真武百煉傳裝備可在哪個關卡中獲得? ",
          "答案": "聚寶洞天 󠀞󠀞󠀞󠀞󠀞󠀞",
        },
        {
          "題目": "真武百煉傳仙寵競速可在哪裡遊玩? ",
          "答案": "奇遇 ",
        },
        {
          "題目": "真武百煉傳哪個品質的裝備最好? ",
          "答案": "紅色品質 ",
        },
        {
          "題目": "真武百煉傳仙寵功能是幾級開放? ",
          "答案": "28級 ",
        },
        {
          "題目": "真武百煉傳仙器功能是幾級開放? ",
          "答案": "20級 ",
        },
        {
          "題目": "真武百煉傳首儲可獲得哪隻仙寵?",
          "答案": "神.熾翼凌凰",
        },
        {
          "題目": "真武百煉傳聚靈妖丹可在哪個關卡中獲得?",
          "答案": "斥天谷",
        },
        {
          "題目": "真武百煉傳排行榜能看到甚麼榜?",
          "答案": "以上皆是",
        },
        {
          "題目": "山海有妖獸WEB版/日常任務達到活躍100可獲得甚麼獎勵?",
          "答案": "100仙玉、5萬靈石",
        },
        {
          "題目": "山海有妖獸WEB版/哪個異獸為資質17的異獸?",
          "答案": "齊天大聖",
        },
        {
          "題目": "山海有妖獸WEB版/首儲可獲得哪隻異獸?",
          "答案": "青龍",
        },
        {
          "題目": "山海有妖獸WEB版/高級孵化幾次必得五星異獸? ",
          "答案": "30次",
        },
        {
          "題目": "山海有妖獸WEB版/精魄可從每日修行中的哪個關卡中獲得?",
          "答案": "異獸關卡",
        },
        {
          "題目": "山海有妖獸WEB版/新手登入十天獎勵,第二天獎勵為何?",
          "答案": "應龍",
        },
        {
          "題目": "山海有妖獸WEB/快速作戰可獲得幾分鐘的掛機收益?",
          "答案": "120分鐘",
        },
        {
          "題目": "山海有妖獸WEB/異獸羈絆有哪些?",
          "答案": "以上皆是",
        },
        {
          "題目": "山海有妖獸WEB/桑樹中有甚麼功能?",
          "答案": "以上皆是",
        },
        {
          "題目": "山海有妖獸WEB/哪個是聖品法器?",
          "答案": "寶蓮燈",
        },
        {
          "題目": "山海有妖獸WEB/免費十連抽可取得五星異獸，請問哪個等級可以獲得?",
          "答案": "以上皆是",
        },
        {
          "題目": "妖靈物語/遊玩第七天可獲得甚麼時裝? ",
          "答案": "金鼠賀喜",
        },
        {
          "題目": "妖靈物語/遊玩就送",
          "答案": "VIP10",
        },
        {
          "題目": "妖靈物語/每天任務可以完成幾次？",
          "答案": "10次",
        },
        {
          "題目": "妖靈物語/哪個是一開始能獲得的法寶? ",
          "答案": "筋斗雲",
        },
        {
          "題目": "妖靈物語/哪個是聖品法器?",
          "答案": "寶蓮燈",
        },
        {
          "題目": "妖靈物語/銘文可以從那裡獲得？",
          "答案": "銘文塔",
        },
        {
          "題目": "妖靈物語/仙寵要升星需要甚麼道具?",
          "答案": "仙寵升星丹",
        },
        {
          "題目": "妖靈物語/遊戲內特權有分哪幾種?",
          "答案": "以上皆是",
        },
        {
          "題目": "妖靈物語/丹藥的種類有哪幾種？",
          "答案": "以上皆是",
        },
        {
          "題目": "妖靈物語/活躍值可從哪裡獲得?",
          "答案": "以上皆是",
        },
        {
          "題目": "守衛主公變態版/日常任務中，兌換五次銀兩可獲得?",
          "答案": "尋寶券 ",
        },
        {
          "題目": "守衛主公變態版/日常任務中，進行五次競技可換?",
          "答案": "召喚神石",
        },
        {
          "題目": "守衛主公變態版/日常任務中，挑戰一次世界BOSS可獲得?",
          "答案": "裝備神石 ",
        },
        {
          "題目": "守衛主公變態版/儲值元寶比率為多少?",
          "答案": "1:100  ",
        },
        {
          "題目": "守衛主公變態版/幾等開啟主公府?",
          "答案": "50等",
        },
        {
          "題目": "守衛主公變態版/登入5天會送甚麼?",
          "答案": "25000元寶",
        },
        {
          "題目": "守衛主公變態版/日常任務中，進行30次征戰可獲得?",
          "答案": "中級培元丹",
        },
        {
          "題目": "守衛主公變態版/登入就送哪隻武將?",
          "答案": "關羽",
        },
        {
          "題目": "守衛主公變態版/甚麼是登入遊戲就送的?",
          "答案": "以上皆是",
        },
        {
          "題目": "守衛主公變態版/奪旗副本開啟等級?",
          "答案": "級27",
        },
        {
          "題目": "天竺鼠骰骰/熱賣商店中的免費寶箱可以如何獲得?",
          "答案": "看廣告",
        },
        {
          "題目": "天竺鼠骰骰/骰子有哪些品質?",
          "答案": "以上皆是 ",
        },
        {
          "題目": "天竺鼠骰骰/傳說骰子(祭品)有甚麼功能?",
          "答案": "以上皆是",
        },
        {
          "題目": "天竺鼠骰骰/哪個不是組合技?",
          "答案": "中二之力",
        },
        {
          "題目": "天竺鼠骰骰/金幣可以用來做甚麼?",
          "答案": "升級骰子",
        },
        {
          "題目": "天竺鼠骰骰/哪些是BOSS的種類?",
          "答案": "以上皆是",
        },
        {
          "題目": "天竺鼠骰骰/購買月卡可獲得幾%回饋",
          "答案": "888%",
        },
        {
          "題目": "天竺鼠骰骰/聯賽最高排位是多少？",
          "答案": "最強王者V",
        },
        {
          "題目": "天竺鼠骰骰/好友有甚麼好處?",
          "答案": "以上皆是",
        },
        {
          "題目": "天竺鼠骰骰/七天成長企畫可以拿到甚麼獎勵？",
          "答案": "以上皆是",
        },
        {
          "題目": "天竺鼠骰骰/世界BOSS的活動時間為何？",
          "答案": "19:00～20:00",
        },
        {
          "題目": "萬劍修羅/哪個道具能夠直接將羽翼升階?",
          "答案": "神翼直升丹",
        },
        {
          "題目": "萬劍修羅/競技場獲勝可以取得甚麼?",
          "答案": "榮譽點",
        },
        {
          "題目": "萬劍修羅/哪個是聖品法寶?",
          "答案": "魂元傘",
        },
        {
          "題目": "萬劍修羅/新手登入送的豪禮價值多少?",
          "答案": "1888",
        },
        {
          "題目": "萬劍修羅/要輸入那個禮包碼才能獲得大禮？",
          "答案": "以上皆是",
        },
        {
          "題目": "萬劍修羅/遊戲內公共戰場內有幾隻BOSS?",
          "答案": "7隻",
        },
        {
          "題目": "萬劍修羅/翅膀升階需要用到那個道具？",
          "答案": "神翼進階石",
        },
        {
          "題目": "萬劍修羅/每日登入簽到可以取得什麼？",
          "答案": "以上皆是",
        },
        {
          "題目": "萬劍修羅/哪些是遊戲內的特權卡?",
          "答案": "以上皆是",
        },
      ]

      @keyword = params[:keyword]

      if @keyword.present?
          @inquires.filter! do |inquire|
             inquire[:題目].include? @keyword
      end
    end
  end
end