class Videos4Controller < ApplicationController
  def index
      @videos4 = [
        {
          "活動": "請自行注意登記時間,記得在12/1-12/11將商品加入購物車" ,
          "連結": "momo購物網消費筆記 12/01更新" ,
        },
        {
          "活動": "不限金額下單抽11/14-12/31年終感恩季-下單抽SONY影音娛樂組",
          "連結": "https://momo.dm/mmyVze",
        },
        {
          "活動": "12/01-12/0912.12年終盛典-下單抽12倍回饋",
          "連結": "https://momo.dm/IIjAJI",
        },
        {
          "活動": "12/1-12/11將商品加入購物車並於12/12當天消費,即可抽訂單只要$12(贈予訂單金額扣除12元之紅利金)",
          "連結": "12.12年終盛典-12元清空購物車\\n\\nhttps://momo.dm/rnvrvZ",
        },
        {
          "活動": "12/01-12/15超商取貨活動-momo購物網",
          "連結": "https://momo.dm/3zJmmy",
        },
        {
          "活動": "11/14-12/31集點加價購momo-年終感恩季-集點加購 ",
          "連結": "https://momo.dm/RRrueE",
        },
        {
          "活動": "11/14-12/31消費滿額登記送momo-年終感恩季-滿額送$5500",
          "連結": "https://momo.dm/22BrVm",
        },
        {
          "活動": "❗12/12限定",
          "連結": "務必看清遊戲規則",
        },
        {
          "活動": "12.12年終盛典-滿額瓜分120萬",
          "連結": "https://momo.dm/e6qNqq",
        },
        {
          "活動": "12/12不限金額下單登記抽12.12年終盛典-下單抽谷關日式奢華之旅 ",
          "連結": "https://momo.dm/EFuvQ7",
        },
        {
          "活動": "12/12累積消費滿$1,212登記送12.12年終盛典-滿額送麥當勞",
          "連結": "https://momo.dm/rJb3V7",
        },
        {
          "活動": "12/12累積消費滿$2,122登記送築間幸福鍋物肉盤連結尚未出來，先放攻略網址",
          "連結": "12.12年終盛典-12.12攻略 https://momo.dm/zqVzZq",
        },
        ]
          end
        end