class Videos28Controller < ApplicationController
    def index
        @videos28 = [
        {
          "活動": "電費 (街口繳費可參照綁定支付,超商繳費可參照超商代收,icash繳費在7-11)",
        },
        {
          "活動": "國泰Cube icash卡 10%電費\\n(需逐月登錄,每月回饋上限200點)",
        },
        {
          "活動": "一銀icash聯名卡宜蘭認同icash卡 新卡icash\\n自動加值 10% OP (核卡後90天內)",
        },
        {
          "活動": "元大Hello Kitty鑽金聯名卡 新戶自動加值 5%\\n(每期帳單回饋上限100)",
        },
        {
          "活動": "土銀icash2.0聯名卡 自動加值 5%\\n(每月回饋上限200)",
        },
        {
          "活動": "街口 + 魔Buy卡 舊戶 6% / 新戶 8%\\n當月指定支付需滿3000及登錄\\n新戶3000~3333 8%\\n舊戶3000~5000 6%",
        },
        {
          "活動": "街口 + 一銀ileo卡 舊戶5% / 新戶6% (每月刷卡上限8333,需ileo帳戶扣繳)",
        },
        {
          "活動": "街口 + 彰銀my樂卡 3.5%or6.5%\\n(需每月一號登錄)",
        },
        {
          "活動": "街口 + 台新街口聯名卡 週三 6%\\n(回饋為街口幣,每月上限4000)",
        },
        {
          "活動": "街口 + 匯豐匯鑽卡 3%or6%\\n(3%回饋累積至5000點可抵10000刷卡金)",
        },
        {
          "活動": "街口 + 玉山Ubear 3.8%",
        },
        {
          "活動": "街口 + 華南i網購 3.5%",
        },
        {
          "活動": "街口 + 合庫藍兔 3%",
        },
        {
          "活動": "Pi錢包Pi幣折抵",
        },
    ]

    @keyword = params[:keyword]

    if @keyword.present?
        @videos28.filter! do |video|
           video[:活動].include? @keyword
        end
      end
   end
 end