class Videos2Controller < ApplicationController
    def index
        @videos2 = [
        {
          "活動": "11/1-11/8 每日09:11、10:11、11:11、12:11、13:11、14:11、15:11、16:11、17:11、18:11、19:11、20:11、21:11、22:11 限量開搶每人每日限搶一次",
          "連結": "11.11超狂購物節-狂撒百萬紅包",
          "完美": "https://momo.dm/JAJBAB",
        },
        {
          "活動": "11.11超狂購物節-天天簽到",
          "連結": "累積簽到最高送$95+$16momo幣",
          "完美": "https://momo.dm/juq6Uu",
        },
        {
          "活動": "11/1-11/14每人每週(週一至週日)限參加一次",
          "連結": "看看買-1101-1114 1111豪買節(A)",
          "完美": "https://momo.dm/FmBuyu",
        },
        {
          "活動": "11/1-11/14",
          "連結": "1111豪買節-積分賽(A)",
          "完美": "https://momo.dm/ayyNjf",
        },
        {
          "活動": "活動總覽",
          "連結": "https://momo.dm/N6uau6",
          "完美": "",
        },
        {
          "活動": "折價券天天免費領",
          "連結": "https://momo.dm/qRb2j3",
          "完美": "",
        },
        ]
          end
        end