class Videos17Controller < ApplicationController
    def index
        @videos17 = [
        {
          "活動": "JCB晶緻悠遊卡 10% (需逐月登錄,每月37000卡&回饋上限50)",
        },
        {
          "活動": "新光新光三越聯名卡 10% (需逐月登錄,每月回饋上限50)",
        },
        {
          "活動": "聯邦幸福M卡 10%  (每月回饋上限100,到2/28)",
        },
        {
          "活動": "凱基悠遊聯名卡 10% (需逐月登錄,每月回饋上限50)",
        },
        {
          "活動": "遠銀快樂卡/C’est Moi旅遊悠遊卡  5% (需逐月登錄,每月回饋上限50,可跟JCB10%疊加)",
        },
        {
          "活動": "一銀綠活卡 5% (需新增單筆滿千一般消費)",
        },
        {
          "活動": "合庫i享樂生活5% (當期帳單需新增一般消費2999,每月刷卡上限2000 )",
        },
        {
          "活動": "合庫i運動卡  5% (當期帳單需新增一般消費2999,每月刷卡上限2000 )",
        },
        {
          "活動": "台中銀哆啦a夢卡 2.5% (當期帳單需新增3000一般消費且要在8大通路加值)",
        },
    ]

    @keyword = params[:keyword]

    if @keyword.present?
        @videos17.filter! do |video|
           video[:活動].include? @keyword
        end
      end
   end
 end