class Videos5Controller < ApplicationController
    def index
        @videos5 = [
          {
            "題目": "長期投資策略就是抱緊處理嗎?" ,
            "答案": "基本題:B.A.A.A.A\\n\\n進階題:A.A.B.B.A\\n\\n應用題:B.A.A.A.A\\n\\n情境題:A.A.A.A.B",
          },
          {
            "題目": "短期投資、投機、交易不一樣嗎?" ,
            "答案": "基本題:B.A.A.A.B\\n\\n進階題:B.A.A.A.B\\n\\n應用題:A.A.A.B.A\\n\\n情境題:A.A.B.A.A",
          },
          {
            "題目": "風險與報酬有什麼關係?" ,
            "答案": "基本題:A.A.A.B.A\\n\\n進階題:B.A.A.B.A\\n\\n應用題:B.A.A.A.A\\n\\n情境題:A.A.B.A.A",
          },
          {
            "題目": "為什麼要分散風險" ,
            "答案": "基本題:B.B.B.A.A\\n\\n進階題:B.A.A.A.A\\n\\n應用題:A.A.A.B.A\\n\\n情境題:A.A.A.A.A",
          },
          {
            "題目": "財報基本分析是什麼?" ,
            "答案": "基本題:A.A.B.A.A\\n\\n進階題:A.B.A.A.A\\n\\n應用題:A.B.A.B.B\\n\\n情境題:A.B.A.A.A",
          },
          {
            "題目": "人不理財?財不理你?" ,
            "答案": "基本題:A.A.A.A.B\\n\\n進階題:A.B.A.B.B\\n\\n應用題:B.A.B.A.A\\n\\n情境題:A.A.B.A.A",
          },
          {
            "題目": "理財規劃好燒腦，到底要怎麼做?" ,
            "答案": "基本題:A.A.B.A.A\\n\\n進階題:B.B.A.A.B\\n\\n應用題:B.B.A.A.B\\n\\n情境題:A.A.A.B.A",
          },
          {
            "題目": "風險評估:你的風險屬性、商品的風險。" ,
            "答案": "基本題:.A.A.B.B.A\\n\\n進階題:A.B.A.A.A\\n\\n應用題:A.B.A.A.B\\n\\n情境題:A.B.A.A.B",
          },
          {
            "題目": "理財金三角有聽沒有懂?" ,
            "答案": "基本題:A.A.A.B.A\\n\\n進階題:B.B.B.A.A\\n\\n應用題:A.A.B.A.A\\n\\n情境題:B.A.A.A.A",
          },
          {
            "題目": "風險管理很重要嗎?人為生麼需要保險?" ,
            "答案": "基本題:A.A.A.A.B\\n\\n進階題:B.A.B.A.A\\n\\n應用題:A.A.B.B.A\\n\\n情境題:B.A.A.B.A",
          },
          {
            "題目": "保險商品霧煞煞?" ,
            "答案": "基本題:A.A.A.B.A\\n\\n進階題:B.A.A.A.B\\n\\n應用題:B.A.A.A.A\\n\\n情境題:A.B.B.A.A",
          },
          {
            "題目": "投資vs保險，矛盾大對決!" ,
            "答案": "基本題:A.B.A.B.A\\n\\n進階題:B.A.B.A.A\\n\\n應用題:A.A.B.B.A\\n\\n情境題:A.B.A.A.A",
          },
          {
            "題目": "投資工具五花八門，到底有什麼差?" ,
            "答案": "基本題:B.A.A.A.A\\n\\n進階題:B.A.A.B.A\\n\\n應用題:A.A.A.B.A\\n\\n情境題:A.B.B.B.A",
          },
          {
            "題目": "總經基本分析又是啥?" ,
            "答案": "基本題:A.A.A.A.A.\\n\\n進階題:A.A.A.B.A\\n\\n應用題:A.B.A.A.A\\n\\n情境題:A.A.A.B.A",
          },
          {
            "題目": "技術分析學起來會很難嗎?" ,
            "答案": "基本題:B.A.A.A.A\\n\\n進階題:B.A.B.A.A\\n\\n應用題:A.B.A.A.B\\n\\n情境題:A.A.A.A.A",
          },
          {
            "題目": "到底要怎麼投資債劵呢?" ,
            "答案": "基本題:B.A.A.B.B\\n\\n進階題:A.B.A.A.A\\n\\n應用題:A.A.B.A.B\\n\\n情境題:B.A.A.A.B",
          },
          {
            "題目": "到底要怎麼投資權證呢?" ,
            "答案": "基本題:B.A.A.B.B\\n\\n進階題:B.B.A.A.A\\n\\n應用題:A.A.A.A.B\\n\\n情境題:A.B.A.A.A",
          },
          {
            "題目": "到底要怎麼投資外匯呢?" ,
            "答案": "基本題:B.A.A.A.B\\n\\n進階題:A.B.A.A.A\\n\\n應用題:A.A.A.A.B\\n\\n情境題:B.B.A.B.B",
          },
          {
            "題目": "基金大補帖，看這邊就對了!" ,
            "答案": "基本題:A.B.A.A.A\\n\\n進階題:A.B.A.A.B\\n\\n應用題:A.A.A.A.A\\n\\n情境題:A.A.B.B.A",
          },
          {
            "題目": "基金百百種，到底差在哪?類型篇" ,
            "答案": "基本題:B.B.B.A.A\\n\\n進階題:A.B.B.B.B\\n\\n應用題:A.A.A.B.B\\n\\n情境題:B.B.A.A.A",
          },
          {
            "題目": "基金百百種，到底差在哪?標的篇" ,
            "答案": "基本題:A.B.B.A.A\\n\\n進階題:A.B.A.A.A\\n\\n應用題:A.A.A.B.A\\n\\n情境題:B.B.A.A.B",
          },
          {
            "題目": "到底要怎麼投資股票呢?" ,
            "答案": "基本題:A.A.B.B.A\\n\\n進階題:A.A.B.B.A\\n\\n應用題:A.A.B.B.B\\n\\n情境題:A.B.A.A.B",
          },
          {
            "題目": "什麼?!還有這種交易方式!" ,
            "答案": "基本題:B.A.A.A.B\\n\\n進階題:A.A.B.B.A\\n\\n應用題:A.A.A.A.B\\n\\n情境題:B.A.A.B.A",
          },
        ]

        @keyword = params[:keyword]

        if @keyword.present?
            @videos5.filter! do |video|
               video[:題目].include? @keyword
            end
          end
       end
     end