class Videos6Controller < ApplicationController
    def index
        @videos6 = [
        {
          "活動": "1［一銀］宅家生活【10%】\\n👉額度2000元（須登錄）\\n🎁宜蘭卡多［5%］（單筆300元）\\n🎁桃園卡多［5%］（單筆300元）" ,
        },
        {
          "活動": "2［兆豐］利多御璽卡【10%】\\n👉滿2000送200超商券（須登錄）" ,
        },
        {
          "活動": "3［聯邦］指定APP【10%】\\n👉額度1000元/每APP（須登錄）\\n🎁賴點卡多［2%］",
        },
        {
          "活動": "4［凱基］魔buy卡AP【6%/8%】\\n👉額度5000元/3333元\\n👉低消3000元",
        },
        {
          "活動": "5［新光］新光三越卡【10%】\\n👉額度500元",
        },
        {
          "活動": "6［華南］i網購卡【8%】\\n👉額度2500元",
        },
        {
          "活動": "7［華南］東奧卡【20%】\\n👉額度2500元",
        },
        {
          "活動": "8［彰銀］My購卡六日【8%】\\n👉額度5000元",
        },
        {
          "活動": "9［永豐］三井卡【10%】\\n👉額度2000元\\n👉低消1000元（非外送）",
        },
    ]

    @keyword = params[:keyword]

    if @keyword.present?
        @videos6.filter! do |video|
           video[:活動].include? @keyword
        end
      end
   end
 end