class Videos26Controller < ApplicationController
    def index
        @videos26 = [
        {
          "活動": "大眾運輸記得電子票證綁環保集點\\nhttps://www.greenpoint.org.tw/GPHome/",
        },
        {
          "活動": "聯邦幸福M卡 舊戶6% / 新戶20%\\n6%回饋上限500\\n每月刷卡上限8333\\n新戶核卡30日內加碼14%上限500)",
        },
        {
          "活動": "合庫樂活卡6%\\n(原卡0.5%+電帳0.5%+指定通路5%,5%每月回饋上限300)",
        },
        {
          "活動": "合庫i運動卡5%\\n(當期帳單需新增一般消費2999,每月刷卡上限2000)",
        },
        {
          "活動": "一銀綠活卡 5%\\n(需新增單筆滿千一般消費)",
        },
        {
          "活動": "國泰KOKO COMBO icash 5%\\n(每期需新增帳金5000,上限6000)",
        },
        {
          "活動": "台新Flygo 4.2%or5%\\n(帳單金額少於5000 4.2% ,帳單金額滿5000 5%,需Richart自動扣繳)通路4% 刷卡上限5000",
        },
        {
          "活動": "彰銀my購 4%",
        },
        {
          "活動": "上海Teresa卡 3.8%\\n(每期上限10000)",
        },
        {
          "活動": "玉山ubear卡 3.8%",
        },
        {
          "活動": "華南i網購 3.5%",
        },
        {
          "活動": "國泰蝦皮購物ICASH聯名卡每月搭乘捷運/公車20次可以拿 50 openpoint (需登錄)",
        },
        {
          "活動": "國泰KOKO COMBO ICASH每月搭乘捷運/公車20次可以拿 50 openpoint (需登錄)",
        },
        {
          "活動": "國泰KOKO (COMBO) 悠遊聯名卡每月搭乘捷運/公車20次可以拿50刷卡金 (需登錄)",
        },
        {
          "活動": "如搭乘時扣款金額為0元(如搭乘台中公車前10公里免費)、或上/下車時其中一次僅感應卡片未扣款，則該次紀錄不列入本活動搭乘次數計算。",
        },
    ]

    @keyword = params[:keyword]

    if @keyword.present?
        @videos26.filter! do |video|
           video[:活動].include? @keyword
        end
      end
   end
 end