class Videos31Controller < ApplicationController
    def index
        @videos31 = [
        {
          "活動": "中華電信(官網刷卡非一般消費)",
        },
        {
          "活動": "街口 + 魔Buy卡 舊戶 6% / 新戶 8%\\n當月指定支付需滿3000及登錄\\n新戶3000~3333 8%\\n舊戶3000~5000 6%",
        },
        {
          "活動": "街口 + 陽信JCB哆啦A夢晶緻卡&彭大家族聯名卡 舊戶 3% 新戶/新卡友 6%\\n街口/Linepay\\n舊戶加碼2%\\n新戶/新卡友加碼5%每月回饋上限300)",
        },
        {
          "活動": "街口 + 一銀ileo卡 舊戶5% / 新戶6%\\n(每月刷卡上限8333,需ileo帳戶扣繳)",
        },
        {
          "活動": "街口 + 彰銀my樂卡 3.5%or6.5%\\n(需每月一號登錄)",
        },
        {
          "活動": "街口 + 台新街口聯名卡 週三 6%\\n(回饋為街口幣 , 每月上限4000)",
        },
        {
          "活動": "街口 + 匯豐匯鑽卡 3%or6%\\n(3%回饋累積至5000點可抵10000刷卡金)",
        },
        {
          "活動": "街口 + 玉山Ubear 3.8%",
        },
        {
          "活動": "街口 + 華南i網購 3.5%",
        },
        {
          "活動": "街口 + 合庫藍兔 3%",
        },
        {
          "活動": "中華電信聯名卡自動扣繳 3%~6%\\n(原卡回饋 3% + VIP加碼 0.5%~3%)",
        },
        {
          "活動": "彰銀My樂自動扣繳 最高2.5%\\n(原始回饋0.5%+數位帳戶滿2萬 0.5%+電帳或帳戶扣繳1.5%)",
        },
        {
          "活動": "富邦數位生活自動扣繳 2%\\n市話沒有2%,但是可以合併帳單到手機帳單",
        },
        {
          "活動": "一銀星璨  ileo 自動扣繳 2%",
        },
        {
          "活動": "Hamipoint折抵\\n(可由Pchome P幣轉換)",
        },
    ]

    @keyword = params[:keyword]

    if @keyword.present?
        @videos31.filter! do |video|
           video[:活動].include? @keyword
        end
      end
   end
 end