class Videos32Controller < ApplicationController
    def index
        @videos32 = [
        {
          "活動": "台灣大哥大\\n(官網或APP刷卡非一般消費,直營門市告知用手機刷卡繳費,參照國內消費)",
        },
        {
          "活動": "新光分期七卡 + OPEN錢包 11%\\n(每月回饋上限110元,需逐月登錄,711繳費)",
        },
        {
          "活動": "新光寰宇現金回饋卡 + Famipay 10%\\n(每月回饋上限100,全家繳費)",
        },
        {
          "活動": "新光悠遊聯名卡 + Famipay 2.1%\\n(每帳單月回饋上限300,全家繳費)",
        },
        {
          "活動": "JCB晶緻悠遊卡自動加值10%\\n(直營門市繳費)",
        },
        {
          "活動": "新光新光三越聯名卡自動加值10%\\n(直營門市繳費)",
        },
        {
          "活動": "聯邦幸福M卡 悠遊卡自動加值10%\\n(直營門市繳費)",
        },
        {
          "活動": "凱基悠遊聯名卡自動加值10%\\n(直營門市繳費)",
        },
        {
          "活動": "遠銀樂家+卡自動扣繳 6%\\n(每月回饋上限600,需遠銀帳戶自扣成功後次期帳單)",
        },
        {
          "活動": "富邦Open Possible卡自動扣繳\\n4G資費 3%\\n5G資費 5%\\n(新辦myMoney數位帳戶扣繳多0.5%)",
        },
        {
          "活動": "富邦台哥大悠遊聯名卡自動扣繳 3%\\n(限扣繳本人號碼)",
        },
        {
          "活動": "彰銀My樂自動扣繳 最高2.5%\\n(原始回饋0.5%+數位帳戶滿2萬 0.5%+電帳或帳戶扣繳1.5%)",
        },
        {
          "活動": "富邦數位生活自動扣繳 2%",
        },
        {
          "活動": "一銀星璨  ileo 自動扣繳 2%",
        },
    ]

    @keyword = params[:keyword]

    if @keyword.present?
        @videos32.filter! do |video|
           video[:活動].include? @keyword
        end
      end
   end
 end