class Videos3Controller < ApplicationController
    def index
        @videos3 = [
        {
          "活動": "12/13-12/14\\n08:12、09:12、10:12、12:12、13:12、15:12、17:12、18:12、19:12、20:12、21:12、22:12\\n限量開搶每人\\n「每時段」限搶一次" ,
          "連結": "12.12年終盛典-整點搶mo幣\\n\\nhttps://momo.dm/2avZJr" ,
        },
        {
          "活動": "12/13-12/19累積簽到分享最高送$23+$7=$30 momo幣將於簽到後立即歸戶使用期限至12/19 23:59",
          "連結": "momo-年終感恩季-天天簽到\\n\\nhttps://momo.dm/Fu3EIU",
        },
        {
          "活動": "12/01-12/14抽mo幣每人每週(週一至週日)限參加一次❗抽mo幣下面還有一個分享抽行李箱",
          "連結": "看看買-1201-1214 1212強強搶(A)\\n\\nhttps://momo.dm/F3fFF6",
        },
        {
          "活動": "12/01-12/14雙12積分賽(A)",
          "連結": "https://momo.dm/ayyNjf",
        },
        {
          "活動": "11/17-12/18投票+分享等抽獎momo購物網-2021第十屆伊林璀璨之星人氣王",
          "連結": "https://momo.dm/YYYRjY",
        },
        {
          "活動": "12/3-12/20投票+分享等抽獎momo購物網-110學年度UBA人氣球隊投票",
          "連結": "https://momo.dm/njZEvJ",
        },
        {
          "活動": "活動總覽",
          "連結": "https://momo.dm/ejmjva",
        },
        {
          "活動": "折價券天天免費領",
          "連結": "https://momo.dm/qRb2j3",
        },
        ]
          end
        end