class Videos2Controller < ApplicationController
    def index
        @videos2 = [
        {
          "活動": "11/22-11/30簽到分享最高送$21+$9=$30momo幣momo幣將於簽到後立刻歸戶使用期限至 11/30 23:59" ,
          "連結": "momo-年終感恩季-天天簽到\\n\\nhttps://momo.dm/BQfjEm" ,
        },
        {
          "活動": "11/15-11/30抽mo幣每人每週(週一至週日)限參加一次",
          "連結": "看看買-1115-1130機智生活節(A)\\n\\nhttps://momo.dm/qqqnVn",
        },
        {
          "活動": "投票+分享等抽獎🅰️\\n\\n11/17-12/18momo購物網-2021第十屆伊林璀璨之星人氣王\\n\\nhttps://momo.dm/YYYRjY\\n",
          "連結": "11/20-11/27momo購物網-2021高雄時尚大賞人氣投票\\n\\nhttps://momo.dm/i3Yzma",
        },
        {
          "活動": "抽獎11/12-12/1momo購物網-Uber x momo購物網輪盤抽獎",
          "連結": "https://momo.dm/if66AQ",
        },
        {
          "活動": "活動總覽",
          "連結": "https://momo.dm/ejmjva",
        },
        {
          "活動": "折價券天天免費領",
          "連結": "https://momo.dm/qRb2j3",
        },
        ]
          end
        end